[
    {
        "url": [
            "https://www.youtube.com/watch?v=OXtOhjeiTzw"
        ],
        "title": [
            "Работа аналитиком за рубежом | Голосовой чат | karpov.courses"
        ],
        "description": [
            "Курс «Аналитик данных»: http://bit.ly/3Z9sCct\n\nМы поговорили о работе за границей, но на этот раз с упором на особенности работы аналитиком в зарубежных компаниях. В прошлый раз спикерами были наши выпускники, переехавшие по студенческой визе (и Валерий Бабушкин, конечно!). В этот раз у нас в гостях специалисты из Германии и Швеции, которые поделились своими историями получения оффера. \n\nМодератором голосового чата выступила HR karpovꓸcourses Оксана Васильева, а спрашивал гостей о самом рабочем  Анатолий Карпов.\n\nУчитесь Data Science с нами: https://karpov.courses/"
        ],
        "audio_path": [
            "../audio/OXtOhjeiTzw.mp4"
        ],
        "text": [
            "Всем привет еще раз. С вами Telegram-чат Karpov Courses. Я Оксана Васильева, руководитель карьерного центра. И сегодня мы будем с вами продолжать разговаривать про рынок труда за границей, особенности работы аналитиком данных международных компаний. С удовольствием сегодня с вами поделимся нашими успешными кейсами получения офферов. Начнем с замечательных гостей из Швеции, Германии и Ирландии. И также сегодня с нами будет наш Анатолий Карпов, который поддержит меня касательно технической составляющей. Можете с удовольствием также писать ему вопросы. Итак, у нас в гостях сегодня Наталья. Расскажи, пожалуйста, пару слов о себе, что ты, чем ты занимаешься в Швеции для того, чтобы, ребята, были представления о тебе. Меня зовут Наталья Белина, я самородом из Самары, там я училась в университете на математика, потом получила PHD по дифференциальным уравнениям, 10 лет это работала доцентом, в частности преподавала статистику и теорию вероятности для студентов разных курсов. И 6 лет назад мой муж получил оффер, уехал в Швецию, и я, соответственно, с ним. Сейчас я работаю уже третий год дата-сайентистом, последнее мое место работы, ну второе фактически, я начала в августе, это сеть универмагов Оленс, это очень известная шведская старейшая сеть, фактически первый e-commerce в 1899 году они начали через рассылку, через почту, и с августа я там работаю дата-сайентистом, до этого работала, это была моя первая работа два года, я отработала тоже дата-сайентистом, в e-commerce называется baby shop, в частности они, ну товары для детей по всему миру, в частности СНГ тоже был представлен. Расскажи, пожалуйста, с чего ты начинала свой путь в мир дата-сайентистом? Так, оказавшись в Швеции, после работы преподавателем в университете, естественно, стал путь, а что же делать дальше, дома мы сидеть категорически не хотим. Я попробовала преподавать в Королевском технологическом в Швеции, поняла, что уровень моего шведского как-то не очень дотягивает, хотя было все легко, абсолютно, в плане программы, там немножечко поменьше требований, чем у нас. Вот, и у меня подружка сказала, слушай, вот такая просто тема классная, офигенная, мир дата-сайентистов, AI и прочее, давай, может быть, и приносящие деньги, прям вот как бы тебя, вот прям ты создала для этого, и я пошла в Google и нашла stepic.org, и так как я сидела два года не работая и упивалась своей ненужностью никому, вот я решила обновить курс статистики, вот как раз, вот основа статистики, где Анатолий преподавал, прям зашло великолепно, и еще взяла курс R там же, и фактически степик открыл для меня курс мир дата-сайентистов, но потом уже я начала, когда работать, это уже были курсы R и Udemy для того, чтобы именно потянуть AI вещи, нейросети и прочее, прочее, а так со степиком началось. Ну, плюс, скажи, пожалуйста, когда ты только вышла на рынок труда в Швеции, как ты начинала, где ты искала вакансии, расскажи про свои первые такие непростые шаги. Да, первые непростые шаги, Швеция вообще очень заточена для людей, чтобы выбросить их на рынок труда, специалистов в уровне достаточно мало, потому что не потому, что они учат, учат хорошо и классно, только молодежь предпочитает уезжать из Штаты, поэтому компаний очень-очень много, и это древен, новая тенденция, а в Швеции больше набирала обороты. В Швеции есть несколько государственных программ, которые работают со службой занятости, я пришла туда, зарегистрировалась, и мне подсказали программу, называется «Короткий путь», вот перевожу, и там с ментором они помогают составлять резюме и отсылать в разные компании, как бы взять на практику, а после этого у тебя как бы небольшие референсы есть, и мое резюме было вот в этой службе занятости, и со мной просто вышли на связь, то есть я даже вот первую работу я получила вообще ничего не делая, фактически, мне позвонили, сказали, а не хочешь попробовать, я сказала, а хочу, я пришла, это было самое удивительное интервью из всех вообще возможных, мы просто посидели, поговорили, меня спросили, типа, а вот что ты будешь делать, на какие параметры будем смотреть, там, рассылки, там, письма или что-то, вот что бы ты там делала, и всё, у меня одновременно было техническое и такое обыкновенное интервью, но это не показатель, то есть первая работа мне попалась очень легко. Расскажи, были ли этапы, там, какие-то тесты тебе давали, техинтервью, или больше в целом, да, какую-то презентацию о себе и по софтам? Первая вообще была не классическая, я пришла, меня спросили, там, типа, что ты будешь делать, там, в случае, вот, мы рассылаем сообщение, как будем там смотреть, влияет, повлияло, не повлияло, ну, по АБТ-тесту, фактически, вот, и всё, то есть мы больше так разговаривали о себе, через два года я меняла работу, и вот там уже было всё по-другому, первое было интервью, интервью с командой, потом интервью с HR, потом мне выслали тестовые задания, причем, так интересно, тестовые задания у них тоже было практически на АБТ-тест, вот, там, делали рекламу, две группы, трам-пам-пам, вот это всё, я его презентовала, все результаты, анализы рекламной компании опять этой всей команде, после чего было четвертое интервью с шефом моего шефа, вот, то есть у меня было четыре интервью, и потом, соответственно, мне прислали офер, я проходила еще несколько интервью, другие компании, но обычно они классические, сначала HR, потом команда, техническое задание, вот это вот всё, но я проходила в H&M, они сначала дают тестовые задания, чтобы на вход пройти, причем тестовые, не просто тестовые задания, а ряд вопросов, у тебя есть, по-моему, 15 минут, могу врать, может, и 20, чтобы ответить, вопросы от SQL до, там, дата инженерно-мужских вещей, плюс по статистике тоже, там, найти, там, медиану, отклонения и так далее, вот тоже такие попадались, вот, это у меня входной такой, который отсеивает, вот в H&M я прям знаю, вот это, по-моему, единственное, когда мне попалось такое первое на вход, а там дальше уже HR и всё-всё-всё. Наташа, мне кажется, можно я перепочу немножко? Сразу же такие, мне кажется, всплывают вопросы, правильно ли я понимаю, что, в принципе, стэк, он приблизительно одинаковый, или есть какие-то концептуальные различия, вот, то, чего, как говорится, в России не учат, или же классика, там, Python R, Postgres, MySQL и ничего необычного? Вот, именно, аналитика, видеоаналитика, классическая, что не умеем, научим на месте, вот такой вот подход. Понятно, понятно. Итого, чтобы подытожить финально сейчас, ты где находишься, в какой компании работаешь? Я работаю в OLENS, это Швеция, Стокгольм, мы продаем в Стокгольме и в Норвегии. Ты упоминала, что на стэпке как раз проходила R, тоже есть такое расхожее мнение, что если в России больше доминирует Python везде в обработке данных, то в Европе R куда более сильно распространен. По твоему опыту, насколько вообще часто тебе приходится вот в этих двух языках работать? Вот смотри, я начинала на R, потому что я ничего другого не знала, но постоянные проблемы в продакшене, когда требуется очень много памяти, когда создаешь докер имидж, начинаются какие-то постоянные проблемы, проблемы, проблемы. Просто в Python настолько все как-то гладко, понятно и красиво, вот, хотя я очень люблю R, вот пришлось переместиться на R, но у меня коллега и половина наших моделей там, где я сейчас работаю, написаны на R. Вот часть из них переписывается под Python, но также продолжаются много вещей и функционируют на R. Интересно, интересно, да. Ну вот я тоже слышал часто, что R, так сказать, еще довольно активно используется. Хотя, в принципе, вот эта ситуация, когда половина скриптов на Python и половина на R, в принципе, тоже часто я и в России встречал, потому что где-то действительно местами R может удобнее быть, но как только дело, как ты правильно сказала, доходит до какого-то продакшенализирования, то хочется просто взять все на Python переписать. А что касается хранения данных, какие вот вообще системы используете? Вот смотри, когда я работала в Боби-шоп, у нас был Snowflake, вот, Snowflake, ну и Google Analytics, соответственно, в BigQuery все валилось. Здесь у нас Azure и, соответственно, все дата-инженеры, я точно не могу сказать, но все вот в этой среде они там и хранят. Ну, то есть я правильно понимаю, что доминирует концепция все-таки облачного хранилища, противовесно самому там развернуть и поддерживать свое какое-то, да? Интересно, да, интересно. Вот это, мне кажется, принципиальная разница, потому что большие компании, насколько я понимаю, в России очень часто классика заключается в том, что именно разворачивается какой-то свой сервак и есть целая команда из десятков дата-инженеров, которая все это дело менеджерит постоянно. Да, в то время как тоже, я смотрю, очень часто в зарубежных компаниях гораздо распространенный кейс, когда мы просто полностью все это дело отдаем в облако. Ну, кажется, кстати, что в России тоже постепенно это становится уже такой, неудивительно. Надеемся, что Azure и Google Cloud не уйдут, как они там что-то пытались сказать. Я тебе еще больше всем могу сказать, например, HMDM, они сейчас начинают мультиоблачность. Если они все делали в Azure, то теперь они еще присоединяют к Google Cloud. Так что очень интересно, чем это у них все закончится. Посмотрите, у меня очень много знакомых работает, там у меня муж его консультировал их. Слушай, ну еще, наверное, тоже финальный вопрос от меня. Очень часто происходят такие бесконечные споры, где заканчиваются границы ответственности аналитика. Ты упомянула, что тебя вот прямо по датаинженерной части тоже спрашивали. А вот в итоге на практике, когда ты работаешь аналитиком, как это выстроено? Что сами пайплайны и какие-то там именно хранилища, ты вообще не ползаешь и этим всем занимаешься датаинженеры? Или тоже приходится ручками что-то иногда там пособирать, поделать интересного именно с датой? Вот тут очень интересно. Когда я только начинала, то есть я пришла вообще без всяких знаний, да еще и в бизнес, и тут задачи бизнеса приходится решать. Это была первая беда. Вторая беда была в том, что у меня был датаинженер. И только-только зарождался дата-сайенс и рекомендации, все основанные на моделях. Поэтому мы все делали сами. Learning by doing было. Делали все от чистки данных, построения моделей, дальше построение пайплайнов, создание докер-образов. Потом мы, у нас был в кибернете сейчас куб-флоу, соответственно, гугл-платформ, полностью вводили в продакшн пайплайны. Вот, то есть у нас не было никакого датаинженера. То есть я все учила сама, как упаковывать эти контейнеры, как технологию контроля версии, там, гейм, у нас было на Гитхаге. От и до. А потом я пришла в другую компанию, и там мы используем, соответственно, Databricks, и у нас модельки, вот просто ноутбук прогоняется и выводит результаты как таблички, дельта-таблицы в Databricks, они там хранятся, паркеты где-то там. То есть я сейчас пытаюсь развернуть, говорю, давайте мы будем использовать Azure DevOps, хотя бы посмотрим это как контроль версии, потому что невозможно между девелопментом и продакшном каждый раз копировать ноутбуки. Давайте начнем с этого. Так что уровень везде, во всех компаниях разный. Даже среди одной компании, например, я могу судить по Volvo, по Volvo Cars, у них есть просто какие-то нереально крутые вещи, которые там занимаются, там, безопасность и прочее. А есть те, кто практически делает а-ля Data Science. Кажется, это, как говорится, интернациональная особенность аналитики. Ну, здорово, здорово, слушай, очень классно, что тебе удается совмещать как раз-таки вот именно и бизнес-понимание, и такую-то инженерную часть. Я-то тоже всегда, как говорится, был сторонником этого подхода, и даже те курсы, которые я читаю, всегда довольно много внимания уделяем дата-инженерным каким-то штукам, типа Airflow, GITA и вот это все. Интересно было послушать, да, как это в больших европейских компаниях. Спасибо, спасибо, спасибо. Оксана? Еще прям пару слов. Ага. И еще про востребованность. На самом деле, присылайте резюме. Сейчас у меня LinkedIn просто без стрита, Data Analytics, Data Science и ищем. А если просто Golm, это HMDM, это Ericsson, Volvo Cars.\n",
            "Сейчас 800 человек набирают просто в Стокгольм у них на западном побережье, сейчас еще один офис открывают. Дальше это Tele2, Spotify и King. King это игры, которые постоянно ищут дата-аналитиков, и именно эти компании помогают с релокацией. То есть у них это налажено, просто на поток поставлено. Подскажи, пожалуйста, они ищут джунлов, да, либо уровень middle, высшее? Middle, они начинают с middle, а джунлов, как правило, такая, ситуация такая, те, кто в университете учатся, на machine learning и прочем, они пишут, как правило, дипломные свои, мастера дипломной работы на базе многих компаний. В NChin Dem полно их пишут, и многие остаются. Это вот что касается джунлов. Джунлов тоже востребованы, вот мы буквально месяц назад ко мне в команду собеседовали, разного уровня, и в итоге взяли джунла, потому что он нам как-то больше подошел, все сказали за, а у нас принцип, хоть один кто-то говорит нет, мы не берем этого человека. В основном, конечно, это middle. Финальный вопрос от меня, наверное, всем интересно узнать про вилку зарплаты, вот, или, например, для джуна, для джунла, поведай нам эту информацию. Про зарплаты, я говорю до налогов, налог это где-то 28 процентов, все, что меньше 43 тысяч крон, потом начинается все, что выше, обладаться уже 50 процентным налогом, у нас прогрессивная шкала, поэтому в Швеции ты сильно не выскочишь, всех равняет эта вот система. Так, от джуны начинается это где-то около 40 тысяч крон, ну, на руке, там, это сколько? Ну, там, 3 числа, наверное, небольшие. Middle это уже 50-65, ну, 50-60, там, 65, и 70, это выше, это уже 7, примерно вот такая вот. Я могу сказать, это очень хорошая зарплата, это прям вот, прям вот хорошая. А подскажи по языкам, вот, их интересует, да, ты сказала про то, что ты подтягивал свой шведский, да, если, например, я не знаю шведский, у меня только английский, да, есть ли возможность, да, и на каком уровне должен быть, там, допустим, английский язык? Так, про языки, сразу скажу, английского достаточно, я работаю в шведской-шведской, махрого-шведской компании, вот, у них официальный язык шведский, потому что они вот так и решили, все говорят на английском, то есть у нас митинг прошел на шведском общей компании, мы этим же составом переключаемся к субподрядчику из Англии, все говорят на английском, вот, поэтому все интернационально, в основном, компании интернациональные. Все, что я перечислила, у них официальный язык английский, английского достаточно. Живя в Стокгольме, там, 10-20 лет, многие даже не пытаются учить шведский язык. А какой уровень английского, там, B1, B2, C1, C2? Я вообще в этом не понимаю, уровень английского, если тебя на интервью понимают, это хорошо, вот, потому что очень много индусов с их специфическим английским, русских слышно, я думаю, что это B2, C1. А скажи, пожалуйста, еще касательно, вот, там, в плане эйджизма, да, либо каких-то гендерных приоритетов? По плану эйджизма, вот тут вот, кстати, шведская страна женщина, поэтому боролись, боролись, боролись. Когда у меня муж пошел, сказал, говорит, знаешь, на эту должность, почему-то все хотят женщину, там, да, на СТО, вот. Эйджиндем руководит женщина, оленцем руководит женщина, поэтому в этом плане гендерно нет никаких проблем, мужчина ты или женщина, никто даже не посмотрит, а также никаких нет вопросов по ориентации сексуальной, абсолютно все нормально, без проблем. По поводу возраста тоже нет вообще никаких, да, еще у нас мужчины ходят в декретный отпуск, поэтому, да, с детьми тоже можно, вот. Нет, никто никогда не обращает внимание, какого ты возраста, и на моей первой работе у нас был 60-летний программист, который за 5 лет до этого просто решил стать, там, за 3 года программистом, а где-то вообще не в этой области работал. Спасибо большое, Наталья. А сейчас уже даже до 40 лет меняют свою профессию, то есть 40 лет поменять программиста, там, на хирурга, это нормально считается, то есть человек себя ищет. Отлично. Спасибо большое, Наталья, за этот замечательный ваш опыт. У нас сейчас будет следующий гость. Спасибо. Это Марк. Спасибо. Марк у нас, скажем, у него потрясающий бэкграунд, потому что он, с одной стороны, успел поработать и в Германии, и в Ирландии, сейчас Марк немножко расскажет о том, какую позицию он занимает, да, где он сейчас работает. Марк, тебе слово. Да, всем привет. Спасибо за представление такое, за невероятный опыт, где я работал. Да, соответственно, я сейчас работаю в Ирландии, работаю в TikTok, работаю data scientist. Вот, я расскажу просто немножко про свой путь. Вот, соответственно, я закончил бауманку. Бауманку я закончил, скажем так, не по совсем инженерной специальности, это была такая экономическая, не знаю, кто еще из бауманки есть, факультет ИБМ, такой экономический. Была клитика у нас «Инженеры без мозгов». Но это нам не помешало. Дальше. Вот, соответственно, я начинал свой путь с разработки на VBA, вот, в Excel. Было такое дело в страховой. Вот, и постепенно я шел именно в аналитику, то есть это аналитика по продажам, какие-то аналитики маркетинговых акций и так далее. Вот, потом так получилось, что меня занесло в Home Credit, кто знает. И там я успел, на самом деле, заниматься очень много чем. То есть я там был и системным аналитиком, и архитектором, и data scientist. И как раз в начале моего пути в Home я наткнулся на Эндрю Инджи, на его лекции в Стэнфорде, и начал вообще глубоко туда погружаться, то есть во всю эту историю с мышлерингом. Там я как раз начал набирать, скажем так, хайп. И, соответственно, я там проработал где-то 4 года и понял, что или мне идти в менеджмент, что мне было так себе, либо попробовать себя за границей. Вот, соответственно, если не соврать, я разослал, наверное, где-то около 300 резюме. По очень многим странам, кроме, наверное, Америки. Ну, потому что в Америку попасть довольно сложно. Вот, соответственно, я там менял резюме, потому что в Россию-то, как раз зашел в Headhunter, нажал откликнуться, и тебя пригласили. А, к сожалению, за рубежом это так не работает. Надо там и резюме сделать красивый, и cover letter, там и все такое показать заинтересованию. А где ты искал вот эти 300 вакансий, на которые ты отвлекался? На самом деле это все просто. Основной инструмент поиска – это LinkedIn. Несмотря на то, что он запрещен, но, наверное, там 95% всех уникальных вакансий. То есть есть там всякий монстр, dot-com и все остальные, они в основном или пересекаются, или... Все уникально на самом деле на LinkedIn. Также я иногда... Есть еще такой ресурс AngelList, где есть стартапы, и они там тоже вакансии себе публикуют. Я там откликался, иногда смотрел. И еще такое чисто мануальная операция делал, что-то типа «Top 20 startups in Europe» или «Top 100 startups in Europe, Germany» и так далее. И смотрел уже на их сайтах и откликался, если там что-то есть подходящее. Но 90% – это LinkedIn. Марк, а пока мы не ушли далеко, можешь буквально пару слов сказать про эту важную часть? Мне кажется, для многих будет интересно, потому что действительно, как ты подчеркнул, в России... Я бы не сказал, что там что-то не то с HR-культурой, но просто немножко другая. Действительно, обычно резюме для этого проекта более чем достаточное. Во время, когда ты собеседуешься в Европу и Америку, действительно, covered letter, я думаю, даже не все понимают, о чем речь. Можешь рассказать, что еще нужно, кроме резюме вообще в таких ситуациях? Да, ну на самом деле, первое, что нужно – это резюме. И его надо подкорректировать лучше, понятно, под каждую страну и под каждую вакансию. Но понятно, что когда ты рассылаешь под 50 вакансий, то это слишком становится time-consuming, временно затратным. Поэтому все равно должен быть какой-то шаблон. Просто какие-то такие принципы, которые помогали выделиться именно резюме, это то, что сделать акцент на результатах. У нас, на самом деле, в основном делается акцент на обязанностях, то есть, что ты делал, образно говоря, ITL-процессы настраивал, три модельки сделал, в таком ключе. А там именно, как это помогло бизнесу, важно. То есть, не просто сделать ITL-процесс, а то, что ты сэкономил 10% хранилища в ресурсах, а это какие-то деньги с помощью оптимизации ITL-процедур. Ну, я просто как пример. Вторая часть, да, это cover letter, то есть это просто пояснительное письмо, почему тебя заинтересовала вакансия, что ты можешь дать и что эта компания может тебе дать. Ну, то есть, в общем, если там какая-то структура, то это просто, соответственно, кто ты, какой у тебя опыт, чем тебя привлекла вакансия, что ты можешь дать с точки зрения скиллов. Ну, соответственно, надо смотреть, как вакансия, как матчится, соответственно, то, что ты пишешь. И что, желательно, компания тоже тебе может дать. Ну, там, не знаю, то, что она или какой-то стартап, ты любишь работать в маленькой команде, где можно какие-то изменения быстро выкатывать впрод, и ты получаешь из этого удовольствие. Или там от какой-то сферы, где они... Соответственно, эта компания работает. Тоже это надо указывать. Ну, то есть, например, я раньше играл... Ну, и сейчас иногда поигрываю в покер, и, соответственно, я подавался там на покерстарс, и, кто знает, это три восьмерки, по-моему, покер, я не помню, как это называется. И там я писал, что я очень интересовался, соответственно, покером, играл профессионально, очень хотел как раз подойти к этому с аналитической точки зрения, вот поэтому я такой красивый, хороший, хочу у вас работать. Ну, в данном случае мне это не помогло, но вот это очень важно. Больше, ну, на самом деле-то ничего не надо. Ну, как дополнительные вещи, да, то есть это ваша портфолио, просто это там какие-то статьи, то есть, ну, насчет, там, pet проекта для, не знаю, там, излов синьоров, это такая очень вещь. Не уверен, но если только на какой-то... Ну, да, да, конечно, да, это я чисто такой символ для Джуна больше сказал, да. Да, да, ну вот какие-то там статьи, какие-то эти, это тоже прикольно, можно это показать и описать. Ну, это вот касательно именно поиска работы, да. Хорошо, спасибо, давайте тогда двигаться дальше. Да, соответственно, вот как раз я нашел себе компанию в Берлине, она американская, она занимается разработкой мобильных игр. Там было прикольно то, что как раз компания небольшая, в плане именно в Германии, то есть вообще там больше тысячи человек, но в Германии там команда, не знаю, человек 30. Вот, и я никогда не работал в такой команде, то есть обычно там, не знаю, 100, 200, вот это все. И было прикольно как раз то, что я делал там, ну, практически все с точки зрения данных, то есть там какие-то процедуры, соответственно, визуализацию, АБ-тесты, какие-то ML-ки, модели, да, то есть это выкатывалось впрод, и кто-то это смотрел, и это влияло реально на бизнес, это было прикольно. Вот, и первый раз я поработал в такой прям супер международной команде, то есть у нас были среди 20-30 человек, у нас были, соответственно, русские, у нас были турки, корейцы, испанцы, 3 немца всего, австралиец, ну, то есть вообще такой зоопарк, скажем так, был. Вот, и, соответственно, где-то после, наверное, чуть больше года, полтора, вот, я понял, что надо искать что-то более прибыльное, да, и более интересное, веселое. Вот, и здесь я разослал уже, на самом деле, меньше вакансий, меньше резюмешек, и конверсия была больше, да, то есть важно понимать, что главное сделать этот первый шаг, допустим, в Европе, а потом все станет намного легче. Вот, и я сначала получил оффер от одной немецкой компании, ну, тоже, скажем, американской, которая занимается аукционами, вот, это довольно было прикольно, и мне в какой-то момент, когда я уже принял оффер и написал как раз TikTok, сказали, ну, давай, вот, ты нам послал где-то 2 месяца назад резюме, давай посмотрим, что ты можешь. Вот, и там было в сумме 5 этапов, и я, ну, так, я подумал, ну, 5 этапов, я точно где-то провалюсь, оффер есть, чего заморачиваться, и так с легким сердцем, короче, начал проходить. Первый этап, это важно понимать, что TikTok там не везде вот так вот, а, соответственно, только в ирландском хабе, ну, то есть в Ирландии и там по определенным департаментам.\n",
            "где-то в другом месте, в другой сфере это может отличаться именно процессом. Но плюс-минус он должен быть одинаковый. Соответственно, первый этап — это технические задания. Я, честно говоря, не помню, где, но что-то типа HackerRank или что-то такое. Соответственно, там было две задачи на SQL, нетривиальные, такие довольно интересные. Я уже не помню, в чем суть, но нетривиальные. И две задачи на ML полностью, то есть от, допустим, загрузки данных, идей, то есть какой-то exploratory data analysis, какой-то модель, посмотреть ее точность, как-то ее применить и показать, как это будет работать. Соответственно, второй этап — это уже с членом команды. Это в основном какие-то вопросы по статистике, что ты делал вообще, что тебе нравится, ну все такое, не супер углублено техническое. А потом с TeamLead. У меня так получилось, что мой TeamLead тоже русский, но тоже такой прикол, что мы ни разу на русском не общались. Это довольно странно, не знаю. Соответственно, он уже более технический. То есть такие кейсы мы проходили. То есть есть у тебя задача, как бы ты к ней поступился. Есть у тебя продукт, и как бы с точки зрения статистики и ML, ты бы поставил какую-то рекомендацию. Так вот, machine learning, дизайн, скажем так. Наверное, я бы сказал в упрощенном варианте. А потом это собеседование с продуктом, то есть именно продукт менеджер твоего направления, который был свободен, скажем так, в этот момент. Вот это скорее просто продукт, как бы ты поступил, если бы на тебя свалилось бы много задач. Вот и такие кейсы, такие бизнесовые, скажем так. И последнее, это я бы не назвал интервью, это так, разговор. Это с начальником всего ирландского хаба, хаба департамента, по сути. Это скорее просто поговорить, что тебе нравится, почему ты сюда хочешь. Буквально минут 25 это все было. Вот и все. И, соответственно, мне выслали офер спустя некоторое время. Потом я делал 4 месяца визу. Вот это тоже весело. Когда я пришел, то ни HR, ни продукт менеджера, который меня брал, уже не было. Статус, цикл сделки немножко затянулся. Да, но как раз во время ковида это было чуть посложнее с точки зрения визы. И все, соответственно, я поступил как негодяй. Тот офер я склонил, этот офер TikTok я принял. И, соответственно, я уже полгода работаю в Дублине, в Data Science. В двух словах. Вообще, говоря о Дублине, это было нечто неожиданное? Или, на самом деле, это уже давно такой центр эти тусовки в Европе? Ну, Сарик, когда я просто принимал офер, я вообще особо ничего не знал. Ну, понятно, есть лепреконы, виски, пиво, что еще. Ну, и все такое. Соответственно, потом я начал... Пытался замалировать этот вопрос примерно таким образом. Да, да, да. Вот, потом я начал узнавать, расспрашивать тех, кто уже тут живет, и просто, скажем так, гуглить. И, на самом деле, да. Это, на самом деле, такой Silicon Valley в Европе. То есть, тут все компании, которые вы знаете, есть. То есть, там, Facebook, Google. Кстати, Twitter я не уверен, но, возможно. Ну, короче, 90% компаний, известных на рынке, то есть, там, Microsoft, Amazon, TikTok, здесь есть все. Почему? Ну, я там читал с точки зрения законодательства, точнее, налогообложения корпоративного, но я решил туда дальше не заходить. Ну, раз есть и есть, будем радоваться. Вот и все. Здорово, здорово. Мне кажется, тоже это может стать таким инсайтом. Да, да. Так что тут прям тусовка с точки зрения компаний очень такая тесная и большая, да. Не хочется делать, знаешь, регрессию по одним точкам, но согласно данным первого спикера твоего, правильно ли я понимаю, что дата инжиниринг, скиллы в цене, в цене нынче, когда мы говорим про Data Science? Да. Ну, то есть, здесь важно, чтобы ты делал полный цикл. Точнее, не то, что делал, а ты мог делать, и ты понимал полный цикл всей работы с данными. Потому что важно там, соответственно, найти эти данные. То есть, здесь такие, включаются в том числе soft skills, да, то есть, поспрашивать, обсудить и там подобное. Соответственно, понятно, какой-то экстракт, да, то есть, это SQL, это работа там с разными базами, это тот же Data Engineering, то есть, что-то там, не знаю, какой-то ETL для себя сделать, чтобы потом уже в этой таблице дальше, так сказать, визуализация. И до самого конца, до того, как ты презентуешь свое решение. Потому что, на самом деле, даже твое решение относительно, ну, не только в TikTok, да, но в какой-то более маленькой компании, если ты там плохо как-то презентуешь, показываешь, ну, тоже, ну, такое. То есть, на самом деле, во всей Европе, ну, и, скорее всего, в Америке очень ценится именно то, что ты можешь сделать что-то от начала и до конца. Я бы так сказал. Круто, круто. И, слушай, можешь кратенько еще про спеку пробежаться? Если какие-то... Это мой любимый вопрос, да, уже, в чем-то понял. Что отличается от того, к чему привыкли российские ребята наши, что отличается от цинковских? Да, ну, про TikTok я бы сказал, что отличается все. Ну, как, то есть, тут есть, допустим, Hive, да, то есть, все на Hive, но все остальное тут свое. То есть, тут нет, там, Airflow тут свой. Там даже... И свои инструменты это не только Яндекс придумывает, да? То есть, это из рубежа у него типичные инструменты. Да, то есть, тут нету, там, телеги Slack. Тут все свое. То есть, в TikTok'е тут все свое. Вот. Так что, ну, понятно, что приходится, там, не знаю, время некоторое на то, чтобы приспособиться к этим разным инструментам, да, потому что тут все-таки есть, там, часть китайского такого нарратива. Вот. То есть, ну, надо приспосабливаться. С точки зрения, там, допустим, Германии, то есть, я тоже работал, как и Наталья, да, с Databricks, со Spark'ом и с облаком в Амазоне. Ну, то есть, да, я бы сказал, что здесь больше фокус как раз на облаках. Вот. Но именно с точки зрения, там, собеседования, набора и тому подобное, всем без разницы, что ты знаешь, что ты не знаешь. Главное, что ты это понимаешь, и ты можешь на каком-то своем инструменте это сделать. А уж как это перенести, это дело так и десятка. Прикольно, прикольно. Я вот тоже только хотел подхватить, что как бы всегда очень ценится, ну, как бы это не банально звучало, но способность быстро учиться чему-то новому, потому что тоже меня очень часто спрашивают, почему именно этот стайк, а не другой. Я тоже все время приблизительно отвечаю, что на самом деле надо просто понимать принципы относительно, там, визуализации, допустим, да, а там перейти с табло на Power BI или там самописную какую-то рисовалку, которая есть внутри компании, это уже в каком-то смысле вторая задача, которую решить очень просто, если ты понимаешь какие-то базовые, такие вообще более широкие принципы. Понятно, понятно. Да, не самая тяжелая задача как раз перейти с того, что ты знаешь, на что-то другое. Главное, да, понимать основы и развиваться. Такой немножко тоже вопрос, может быть, есть такие непрекращающиеся дебаты, что, с одной стороны, вот в Европе уровень жизни, он как бы лучше и туда-сюда, но, с другой стороны, работая, там, сеньором в России, у тебя в каком-то смысле покупательная способность может быть даже больше, чем будучи ты специалистом в Европе. Вот тут как бы ты прокомментировал? Ну, до последних событий я согласился бы, а после них уже бы не так. Ну, то есть, смотря какая Европа. Допустим, на самом деле, если говорить именно про деньги, то можно в Европе хорошо зарабатывать не в стольких многих местах. То есть, Ирландия, Англия, Швейцария, ну и Голландия, наверное. Там в той же Испании, в Италии, ну, там оставаться будет не так много. И, да, с точки зрения покупательской способности в России все будет намного лучше. И тут очень важно иметь в виду аренду, потому что она будет забирать довольно много. То есть, я когда, допустим, в Берлине жил и платил где-то 900 евро за однушку, ну, это было сколько, где-то года полтора-два назад, я думал, нифига себе, дорого. А когда я тут в Дублине плачу почти 1800 за однушку, то понимаю, что в Берлине не так плохо было. Вот, то есть, тут важно понимать перспективы. Не только на деньги рассчитывать, но и перспективы. То есть, если сейчас, допустим, тебе предлагают в той же Испании на какую-то среднюю зарплату, но ты понимаешь, что это даст тебе потом рывок, и ты можешь пойти в Англию или еще куда-то, или в России, допустим, вернуться на более высокую должность, то лучше идти. Но с точки зрения покупательской способности, то есть, допустим, в Ирландии, наверное, все-таки чуть выше, но соизмеримо с тем, что было в России, наверное, до каких-то недавних событий. Да, сейчас уже непонятно. Спасибо. Спасибо большое, Марк, что поделился своим ценным опытом. У нас еще есть один гость, Максим. Максим как раз из Германии и сейчас работает в Берлине. Максим, поделись, пожалуйста, как сейчас строится твоя карьера и что у тебя происходит. Всем привет. Очень рад быть тут с вами. Спасибо, что пригласили. Значит, да, действительно, я живу и работаю в Берлине уже 3 года. Начиналось все давно. Мою карьеру я начал в 2009 году простым студентом. Жил тогда в Саратове, был студентом второго курса. Нужны были деньги. Пошел, устроился в первую попавшуюся самую крупную онлайн-компанию в Саратове, совбиси, если кто знает. Потом там я занимался онлайн-рекламой, ВКонтакте, потом Яндекс.Директ и так далее, настраивал для клиентов. После этого там я работал 7 лет и изучал все эти технологии. И потом меня взяли в такую американскую фирму с филиалом в Саратове, то есть программисты и бизнес-аналитики в Саратове, а сам маркетинг и весь бизнес находятся в Америке. Я в такой компании работал еще 3 года и там изучил все основы аналитики данных и так далее. Питон у нас был. На R тоже немного мы использовали. Основное это было контролировать расходы на маркетинг и следить за конверсиями, следить, чтобы все плюс-минус работало корректно. А потом я получил оффер из Берлина и напрямую приехал из Саратова в Берлин. Получилось все достаточно спонтанно. Я отправил 3-4 резюме, точнее 3-4 вакансии, написал сокровительное письмо и из двух компаний мне ответили. Одна это была Золанда, вторая это маленький стартап, который я в итоге и переехал. Началось все, скажем так, волнительно, но в итоге все прошло хорошо, потому что я переезжал не один, я переезжал с семьей и мне было немного непривычно, что все это выглядит. И я всегда считал, что надо сначала попробовать, но в итоге оказалось, что можно взять и переехать по-нормальному. Я переезжал через голубую карту. Это такая льготная программа для переезда в Германию. По ней должна быть зарплата по 43 тысячи евро в год и контракт. Немецкий знать не надо. Основные все документы ты делаешь на месте. Тебе здесь помогают. У меня в таком случае не потребовалась помощь с адаптацией, потому что мне жена знает немецкий. Но многие компании здесь уже знают, как это все работает. Для сыскателя требуется только контракт и все. Посольство в России, насколько я знаю, даже сейчас за одну-две недели готовы сделать визу. В Германии найти жилье сейчас не очень легко, особенно в Берлине. Берлин это самый такой интернациональный город Германии. Здесь очень много приезжих. Я живу здесь уже три года, и мне английский вполне как бы выхватает. Немецкий я учу, но я его почти не использую. А на каком уровне английский у тебя? Подскажи, пожалуйста. А я не знаю, но C1 точно есть. Хотя, когда я приезжал, был, наверное, B2. Но когда я до этого устроился в американскую фирму, у меня от силы был B1. То есть я до этого изучал английский в школе, в универе, но потом без практики было тяжело. Но я думаю, для Европы B1, скажем так, B1,5 будет достаточно. Главное, чтобы на собеседовании с тобой общались, главное, чтобы ты понял все требования, что в тикете написаны. Ну и так в целом. Ну, мог общаться. Опять же, это все индивидуально. Я работаю с людьми, которые открывают тикет, переводят на свой родной язык, делают его и все понимают. То есть они у них английский, ну, A2, может быть, есть. Но в Европе английский почти везде такой свободный, ломанный.\n",
            "не прям уж, как лондонский или там нью-йоркский. Поэтому здесь все понимают, что это для большинства европейцев не родной язык. А скажи, пожалуйста, насколько большая нехватка кадров IT-специалистов сейчас в Берлине? Есть ли такое или, может быть, наоборот, есть избыток? Блин, нехватка огромная. Я работаю в компании, которая называется сейчас Trade Republic. И 18 месяцев назад у нас было 100 человек, сейчас у нас 700. И мы все равно еще ищем, и хотим нанять ее 250 инженеров, технических людей. Из них в отдел дата аналитики примерно 50. Компания офигенная. Какого уровня? Джуны и интерны? Расскажи, пожалуйста. Сейчас расскажу. Как правило, давайте с самого низкого, джуны и интерны. Как правило, это местные студенты, которые приходят проходить практику. Они сначала приходят интерными, потом они остаются уже на джуна. У большинства студентов здесь 25-30 лет, которые уже мастерство делают, либо они пишут свою PHD, защищают. Не знаю, как у них это все устроено обычно. Но, как правило, интерны и джуны – это все местные студенты. Медлы – это те, кто приехали из стран СНГ, либо Индии. Там они были сеньоры, а приехали на медла. Вот со мной точно так же было. Я в Саратове был сеньором, в Европу приехал на медла. Меня все как бы устраивало. Я просто хотел попробовать себя в другой стране. Не так, чтобы я прям стремился переехать, но раз уж получилось, то чего бы не попробовать. А сеньоры очень сильно нужны. И сеньоры именно лиды, которые могут управлять командами, это прям очень сильно востребовано. Но здесь, как правило, нужны хорошие коммуникативные навыки, большой опыт общения, управления. И английский должен быть на уровне. Я не могу сказать, что немецкий как-то обязательно. Нет, он вообще почти немецкий. Если ты приезжаешь в англоговорящую компанию, то английского, естественно, 100% достаточно. А расскажи, пожалуйста, немножко про этапы отбора в твою компанию. Понятное дело, что есть там HR-скриннинг, да? Да, конечно. Здесь, как правило... Да, обычно это три-четыре интервью у тебя будет. Ну, в моей компании это их шесть этапов. Но обычно это интервью с рекрутером. Второе у тебя интервью с тем лидом. Если ты его устраиваешь по софт-скиллам, то тебе дают тестовое задание, ты его делаешь. Потом у тебя техническое, на котором вы его обсуждаете. Как ты сделал, как еще можно сделать. Как можно сделать побыстрее, получше и так далее. Ну, а четвертое тоже, как правило, еще раз с тем лидом для обсуждения условий оффера. И для общего вопроса, когда сможешь выйти, что тебе надо и так далее. Если переезд, то, как правило, этих этапов больше. Здесь именно они смотрят уже по визам, когда ты сможешь приехать, нужны ли тебе билеты на самолет, где тебе жить первые полтора-два месяца. Вот как-то так. Как правило, это очень жесткие интервью, если ты собеседуешься на синьорские позиции. Я работаю в своей компании как бы сейчас тоже. Опять же, я приехал в Берлин из Саратова с синьора на медла. Здесь вырос до синьора, сейчас перешел в новую компанию, опять с синьора на медла. По итогу сейчас я занимаюсь, именно моя позиция называется аналитикс инженер. То есть это нечто среднее между дата инженером и дата сайентистом. Потому что я больше работаю с бизнесом, больше такие задачи у меня для координации, для общения. Так вот, здесь, как правило, навыки у нас, не только навыки, а весь стек технологий у нас достаточно распространен. Основной стек технологии, который мы здесь используем, это все, что надо для именно этого end-to-end. То есть, как правило, это источник данных какой-то. У нас есть, допустим, Google Ads, который складывает данные в BigQuery. Из BigQuery данные мы уже забираем через Airflow к себе в Snowflake. А в Snowflake через DBT мы, скажем так, готовим таблицы и прочие вьюхи, которые нам нужны. После этого все эти данные экспортируются в Looker. И в Лукере уже подстроим дешборды для всей компании. То есть, как правило, ты должен иметь все по чуть-чуть. Но если ты именно дата инженер хороший, то, конечно, тебе дадут больше делать такой работы. То есть очень много, где можно чему-то новому научиться. И, как правило, все технологии очень современные. Сейчас, как я понял, я прохожу собеседование иногда. Мне пишут, кстати, 2-3 раза в неделю приглашают на собеседование. То есть спрос реально огромный. И вот иногда я хожу на собеседование, и там, как правило, компании говорят, мы сейчас мигрируем из Подверса на условный Snowflake. И нам надо настроить всю инфраструктуру, нам надо все пайплайны, чтобы у нас все работало. И примерно так это все выглядит. Но, опять же, я сталкиваюсь, больше работаю с маркетинговыми данными. То есть это и email рассылки, и платная реклама, и Facebook, и Instagram, и все подряд. Ну и помимо этого, конечно, у нас и мобильные приложения есть, а там свой мир. Поэтому с этим всем приходится иметь дело. Но основное, что надо знать, это очень хороший уровень SQL Python. И тогда добро пожаловать. Голубая карта, и все. И вы можете переехать. Ну да, мне тоже эта мысль очень импонирует. Что несмотря на какие-то различия концептуальные в отдельных всяких решениях, я думаю, что там многие из наших студентов, возможно, не работали с Looker, или там Snowflake данные не хранили. Но вот мне кажется, что если есть какое-то очень хорошее понимание базы, то перейти на какую-то новую технологию – это уже история такая. Правильно понимаю, что ты тоже изначально далеко не со всеми инструментами работал, с которыми сейчас сталкиваешься? Конечно, нет. Это все по ходу учится. И, как правило, я начинал, конечно, с Google BigQuery. Я также выучил SQL почти с нуля. У меня, конечно, были базовые знания. Но даже без всяких Window Functions, Analytical Functions я, конечно, никогда ничего не знал. Но постепенно вот так научился, и все. Люди очень добрые, всегда тебя научат. Плюс у меня компания, она спонсирует курсы обучения, конференции, что хочешь. Все это поддерживается. И, наоборот, компания инвестирует в людей и хотят, чтобы ты как можно лучше работал. Потому что сейчас идет тренд на то, чтобы… Да, мы тебе дадим хорошую зарплату, 10-15% выше рынка. Но, помимо этого, мы тебе создадим такие условия, что ты никуда не захочешь идти, потому что здесь большой спрос. И, опять же, можно ходить из одной компании в другую. Но, не знаю, это не для меня, скажем так. Понятно. Максим, спасибо большое. В целом, ребята, огромное спасибо, что поучаствовали. Наталья, Марк, Максим. Мне кажется, основной метрикой успеха нашей сегодняшней встречи будет то, что, возможно, кто-то из ребят поймет, что все не так сложно. Потому что вот к нам как бы постоянно приходят с вопросами. Вот я бы хотел голосироваться, я бы хотел поработать за рубежом, но даже вообще не понимаю, с чего поступиться-то. Потому что кажется, что это просто невозможные задачи. Как можно вообще взять, переехать, работать за рубежной компанией? Но вот видите, живые примеры показывают, что это все решаемые задачи. Поэтому, ребят, спасибо огромное. Очень классно было вас послушать. Прямо мотивирует. И очень-очень-очень круто. Тогда, я думаю, пишите ваши вопросики в чат. Чат-то есть у нас в Carpool of Courses чате. И дальше уже можно будет, если какие-то точные вопросы у вас будут, продолжать обсуждать общение у нас в чатике. Всем спасибо. Был очень рад вас всех слышать. До новых встреч, Оксана. Тебе тоже огромное спасибо, что сегодня с нами этот чат провела. Спасибо большое. До встречи в следующем нашем чате. Всем пока-пока.\n"
        ]
    },
    {
        "url": [
            "https://www.youtube.com/watch?v=9W1v-DkXriY"
        ],
        "title": [
            "Роман Бунин — Что общего между инженерами и программистами? | Подкаст | karpov.courses"
        ],
        "description": [
            "Сегодня в гостях подкаста «IT-шниками не рождаются» Роман Бунин — BI-евангелист в Yandex Cloud и автор блога и канала про визуализацию и BI «Reveal the Data»:  https://revealthedata.com/\n\nЧто нужно оптимизировать на заводах? Что общего у инженеров и программистов? Кто такой евангелист и чем он занимается? А также для чего нужна визуализация данных и в чём разница между аналитиками данных и BI-аналитиками — всё это в новом выпуске!\n\nТайм-коды:\n00:00 — Нарезка избранных моментов выпуска\n00:26 — Начало выпуска и представление гостя\n01:49 — Про работу BI-евангелистом\n05:31 — Про блог «Reveal the Data»\n06:47 — Кем ты хотел стать в детстве и что тебе нравилось в школе?\n10:17 — Как ты выбирал универ?\n14:43 — Как ты изучал AutoCAD?\n16:29 — Про первую работу\n20:03 — Про работу в НИИ и диссертацию\n25:36 — Про смену профессии и переход в японскую консалтинговую компанию\n40:30 — Работа в банке и выгорание\n44:27 — Курс визуализации данных, первая попытка попасть в IT и что из этого получилось \n1:01:05 — Про концепцию системы работы с дашбордами и знакомство с Яндексом\n1:10:16 — Про работу в GO, появление там BI-аналитиков и переход в Облако\n1:14:58 — Как попасть в IT?\n1:21:17 — Что ты думаешь про нейросети?\n1:24:10 — Подкаст выходит при поддержке школы karpov.courses\n\nУчитесь Data Science с нами: https://bit.ly/47owcUy"
        ],
        "audio_path": [
            "../audio/9W1v-DkXriY.mp4"
        ],
        "text": [
            "Выпуск, разоблачение романа Буллина, щепоточку секса на дажбор. Не думал никогда об этом, но теперь подумал. Разве всякие автокадры не делают это за тебя там? Не думаю. Нет, к сожалению. Прикольный был как раз по заводам. У меня была первая попытка войти неудачно. Иди посмотри, как Петрович гайку на 16 затягивает. На ней появилась облачко в виде буквы Я. Все изменится, нас всех победят. Всем привет. В эфире подкаста «Тишеньками не рождаются» и его ведущий Беслан Курашов. Сегодня у меня в гостях Рома Бунин, BI-евангелист в облаке и автор блога и канала про визуализацию BI «Reveal the Data». That's right. Yeah, я смог. Супер. Всем привет. Привет, Рома. Спасибо, что пришел. А Рома-то вообще-то у нас в школе еще преподает. Черт, мы с тобой… Ничего не сказали вообще об этом просто. У нас же можно прийти поучиться к тебе на курсы. И ты научишь там делать хорошо. Расскажи, почему вообще, по-твоему, курс хорош? Слушай, мне кажется, та часть, которую веду в старта, во-первых, есть классный блог. Мы обучаем именно таким основам по визуализации и как собирать требования. Это универсальный навык, для любой BI-системы пригодится. И поэтому, мне кажется, очень такой ценный и полезный. Плюс много практики. То есть ребята, кто проходит курс, реально отзывы, что много практики. И вот мы сейчас снова перезапускаем нашу историю про BI. И еще больше практики. И он получился жутко хардкорным, жутко хардкорным. Поэтому полезно всем с точки зрения именно тем, кто хочет погрузиться глубоко очень в эту тематику. Слушай, мне кажется, основная ценность в том, что вот именно даем не инструменты, а основу, почему это мышление, зачем это нужно и так далее. Понял. Спасибо. Расскажи, пожалуйста, про и работу, и блог, и потом начнем про твой путь. Что ты делаешь на работе, в чем суть твоей работы? Ой, слушай, у меня сейчас забавная должность. Я евангелист. Я, в общем-то, хожу и всем рассказываю, что BI – это классно. Пользуйтесь, делайте графики, строите дэшборды. Ну, шутки шутками, но это такая интересная позиция. Их не очень много, на самом деле, в компаниях. Это люди-евангелисты, либо также называются еще часто дефреллы. Люди, которые занимаются тем, что рассказывают, как правильно пользоваться продуктом. И, с одной стороны, такая история про продажу какого-то продукта. Ну, типа, смотрите, какой у нас классный. Ну, даже не только внутренний, но еще именно, ну, и наружу тоже. А, понятно. Но еще это и про то, чтобы развивать рынок в целом. То есть история не то, что мы с ребятами не столько продвигаем даталенс, сколько мы рассказываем о том вообще, как классно пользоваться BI в целом. Какие есть общие принципы и так далее. Вот. Ну, это где-то 50%, наверное, нормально. Моя работа сейчас текущая. И где-то остальное время занимаюсь продуктовой работой. Работаю с дизайном над нашим продуктом. Работаю с приоритацией фич и так далее. Такие штуки. Вот. А до этого 3 года руководил BI в Яндекс.Го. Это еда, лавка, такси. В общем, все этим пользуются, если все понятно. Вот. И мы там с ребятами построили за 3 года, наверное, одну из самых больших, классных биосистем на рынке. У нас было 220 аналитиков. Я вообще, типа, я когда эти цифры каждый раз называю, не верятся, потому что кажется, что это компания отдельная. Да. И около 3000 пользователей было. И, в общем-то, мы, да, строили классную систему. Потом с Tableau перешли на DataLens. Ну, и, собственно, я сам тоже перешел в команду DataLens. Угу. Но когда же построили биосистему, это вот не то, что вы DataLens разработали, а то, что вы применили биосистему у себя в работе. Да-да-да. Ну, опять же, я как раз под биосистему, я подразумеваю именно систему отчетности теш-портов внутри компании. Да. Не сам инструмент, а результат. А как это работает? Ну, то есть, вот представь, я когда представлял твою работу, я так шутил в голове у себя, что, знаешь, вот есть какой-то аналитик, и просили его что-то посчитать, и он выложил ссылку на VQL-запрос. Там просто код и таблица. Окей. И приходишь, ты бьешь его по рукам. Говоришь, нет, нет, иди, делай график. Что это такое? Кто это сделал? Слушай, ну, в Go примерно так и было. Ну, то есть, literally, как бы вот прям. Смотри, история. Я руководил командой BI как центром экспертизы. Мне кажется, это очень прикольная тема, когда внутри компании есть какие-то штуки, ну, центр экспертизы. То есть, когда мы не замыкаемся централизации не в смысле того, что мы передаем делать дешборды каким-то конкретным людям, а мы приводим, по сути, внутренних консультантов таких, которые обучают аналитиков и ходят тоже, по сути, в смысле, проповедуют. Похожие у меня были задачи. Рассказывать о том, что смотрите, ребят, классно применять графики. У нас есть классный инструмент, который вы можете этого использовать. Смотрите, как вы это можете делать. Поэтому, ну, условно говоря, по рукам не бил. По рукам бил, когда выкладывали плохие дешборды. У нас был процесс сертификации, и если ты выложил в прот плохой дешборд, я мог прибежать и тебя, ай-яй-яй, наказать. Ругать, да, понятно. Поэтому да. У Лебедева же было, что он там, отсматривал то ли сайты, то ли креативы. Помнишь, рубрика была? У меня есть такая. Ты отсматриваешь чужие дешборды. У меня есть рубрика «Прожарка». У меня есть... Раньше я называл это переверсткой, и я сам не прожаривал. Я брал какие-то дешборды и их переделывал, скорее. Показывал какие-то ошибки и смотрел это. А сейчас мы с Сашей Бараковым делаем прожарку. Собираемся, берем чужие дешборды, такие, типа, здесь говно, и тут надо переделать, и здесь плохо. Вот, и так далее, да. Понял. Расскажешь чуть-чуть про блог еще? Да, давай. У меня есть канал Revisadata. Он как раз начался с блога. Когда еще не было модно в Телеграме вести каналы, были блоги. У меня давным-давно был блог. Наверное, лет 7-8 назад. Вот. И я писал про реализацию. Ну, собственно. Однажды я понял, что, вообще говоря, у всех есть... Ну, начали появляться каналы. И три года назад завел канал в Телеграме, и он как-то, на удивление, довольно хорошо сработал. Довольно много числа подписчиков. Я до сих пор, если честно, не знаю, почему это считают в хорошем смысле этого слова. Потому что, ну, тематика довольно узкая. То есть я всегда думал, что визуализация и BI будет интересно меньшему количеству людей, но оказывается большим. Ну, это прекрасно. Я очень рад. Да, почему? Он прикольный же. Наоборот, такой, знаешь, это же человеческий интерфейс к аналитике, по сути. Ну, да, он такой как раз наглядный. Мне нравится, что типа его можно пощупать, условно говоря. Но просто как бы, там, не знаю, ну, в моем мире, типа, нет рынка 18 тысяч аналитиков внутри России, которые читают это. А у тебя 18 тысяч, да. Вот, поэтому просто несоизмеримо, наверное, такие цифры. То есть я не могу себе прикинуть. Понял. Давай тогда перейдем к пути. Ты явно не родился с мыслью заниматься визуализацией и BI. Вообще не разу. Что ты в детстве про себя думал? Вот я вырасту и... Слушай, я в детстве хотел быть поваром. Я любил по утрам готовить для семьи завтраки. Клуб, прикол. Сейчас я думаю, что эти завтраки, это было, конечно, прям, типа, спасибо маме и отцу, что они говорили, что это очень вкусно. Потом это ели, да? Но, наверное, это было не совсем так. Слушай, из такого, что помню, я помню, что какой-то период хотел быть поваром. В каком-то смысле до сих пор я такой думаю, ну, я просто как-то припавлю щепотку красоты на ваши дашборды. Вот, и в этом смысле Вот так, как этот турецкий повар. Вот именно так, да. Щепоточку секса на дашборд, чтобы он все был идеальный. Вот, поэтому в каком-то смысле мешаем, получаем что-то классное. Никогда не хотел быть ни атишником, ни чем-то связанным с техникой и так далее. А что в школе тебе нравилось? Что получалось? Ну, было ли какой-то выраженный, любимый предмет, какое-то направление? Или ты просто тусил и все? Слушай, хороший вопрос. Ну, у меня был... Ты знаешь, я всегда задумываюсь, то ли это ты, когда смотришь назад, тебе мозг подстраивает, и тебе кажется, что так и есть, или то ли это реально так и было, и это сформировало тебя. Мне в школе нравилась физика с математикой, такая техническая часть, и ИЗО. ИЗО и черчение. И сейчас это такое прям, типа, дашборды, типа, все понятно. Да, это сошлось, да. Ты изначально знал, что так и будет на тебе эта серия. Но, ну, по факту, как бы, вот сейчас я смотрю на это, кажется, что это так. То ли мой мозг подстраивает воспоминания, то ли... Не, ну, в целом, действительно, у меня хорошо получалось с математикой, у меня хорошо получалось с физикой. Ну, с физикой похуже. И реально мне нравилось ИЗО. У меня был дедушка, который очень любил рисовать. Он был таким, ну, не профессиональным художником, но умел рисовать маслом и так далее. И, в общем-то, вот мы с ним довольно много времени проводили тем, чтобы что-нибудь отобразить красиво. Ты умеешь рисовать? Нет. При этом, сам прикол, я люблю иногда посидеть, что-нибудь покрутить, но вот в нормальном понятии рисовать нет, не умею. Мне, на самом деле, мне тоже, в каком-то смысле, стыдно до сих пор, потому что дед у меня много делал домашки. То есть, тупо. И мне это, вроде, любовь прижилась к такому чему-то эстетическому, но при этом вот именно нарисовать какой-то пейзаж красивый я, наверное, не смогу. Хотя я все время прорываюсь. Надо будет научиться, надо будет научиться. А тебя в школе не палили с твоими домашками? Я думаю, палили тупо потому, что домашки были, знаешь, как рисунок третиклассника третиклассника, и потом такой, хорошо, давай. Ну, то есть, я думаю, догадывались. Наверное, догадались. У меня просто ровно та же история была. Мой старший брат супер рисует, суперски. Он сейчас почему-то бросил. Я вообще не умею рисовать. Палка, палка, огуречек. Это вот все отверг моих талантов. Один раз я придёс в школу, и им нарисованный портрет, он назывался «Незнакомка в трамвае», и там портрет через окно трамвая. Было супер понятно, что это не я делал. Ну, учителя такие, «М-м, Беслан, молодец!» Так понимаю, ты с этим же сталкивался, да? Да, да, приятно. Поэтому... Окей, и как ты обошёлся со своими вот... Как сказать? Со своими... Хочешь сказать «любовями», но и не так правильно слово «любовь» склоняется. Ну вот ты заканчивал... Увлечение. А вот у тебя были любимые предметы, которые тебя увлекали, и вот пришла пора заканчивать школу, выбирать универ. Ты опирался на это? Нет, слушай, у меня классическая история. У меня как это... Мой друг, он знал, куда он хочет идти, потому что у него там были родственники, кто работал с физикой и всякое такое, и он конкретно шёл в Московский энергетический институт, как бы он туда на подходительные курсы. Ну и я как по классике, типа, ну, недалеко от дома, друг ходит, я тоже пойду, вот, поэтому мы с ним ходили вместе на подходительные курсы, но потом вроде как курсы походили, можно уже и поступить. Поэтому туда я и поступил по инерции. А что ещё раз название институт? Энергетический, наверное, моторный, который находится около Бауманка. Из смешного я сегодня, когда к тебе ехал, я вспомнил, что изначально, у тебя же, получается, айтишники не рождаются, и я такой думаю, я же, оказывается, изначально хотел быть айтишником, но потом я свернул не в ту сторону. Подожди, я не понял. Я вспомнил, что я когда поступал, энергетический институт, кафедра электротехнических материалов, типа, конденсаторы, вот эта вся история, и там была специализация, там были специа... конденсаторы, кабельная техника, и третья специализация была веб-маркетинг. Не спрашивайте, почему она там была, я не знаю, как это придумали, и я такой, типа, модно, молодежно, я хочу туда пойти, я думал, что туда пойду, и в итоге я поступил в МАИ, поступил на эту кафедру, но специализация должна была начинаться только с четвертого курса. То есть до четвертого курса у меня была обычная общая программа, суперинженерная, ну, как бы, вот. И к третьему курсу я понял, что не хочу никаким заниматься веб-маркетингом. А почему, кстати? Что тебя отбило желание? Я сейчас тебе расскажу, выпуск разоблачения Романа Бунина, все было вообще, типа... Я тебе расскажу, почему. У нас была страшная кафедра с плохим ремонтом и страшными коридорами, а кафедра, на которой мы ходили учиться, другая электрических аппаратов, она была классная, ее спонсировали крутые компании, типа, Siemens, ABB, очень красивое оборудование, очень стояли красивые стенды, все было аккуратненько, с ремонтом. И мы вместе с другом, с кем учились, там мы такие, типа, короче, линяем. И мы в итоге перевелись. То есть я поменял во время обучения кафедру и перешел в суперинженерную специальность. То есть у меня уже не было ничего. И вот я сегодня ехал к тебе, такой, типа, черт, так я же, оказывается, мог стать айтишником и раньше, но не стал. По сути, короче, офис. Тебе переменил офис. Можно кафедры за офис присчитать. За внешность, да-да-да. Ну, в общем, я реально понял, что это, типа, падки на визуальную историю. Видишь, опять все складывается. Так, ты перевелся, не скучал потом по паркетингу? Слушай, ну, наверное, нет. Я перевелся на кафедру, как раз вместе с переводом, например, начался работать. Я работал таким хардкорным инженером, я рисовал чертежи. Опять же, в каком-то смысле, ну, тоже айтишная профессия, но это очень забавно, как я ее получил. То есть у нас была возможность чертить руками или чертить в автокаде. И я такой, ну, какие руки? Автокад, да. И в итоге это, типа, ключевой навык, как сейчас у некоторых ребят, там, ключевой навык, не знаю, там, Python, SQL, когда ты не с того, чего ты хочешь делать, а откалываешься от какого-то инструмента, который ты знаешь. И вот я знал автокад, и я такой, автокад, чертежи, пойду чертить. Я работал потом три года в разных компаниях, может, восполнил, короче, в общем, которые делают все из металла. Я вот только за свою карьеру эту чертежную не начертил, вообще каких-то разных совершенно штук, очень странных там. Вот, и то есть пошел от инструмента, так скажем. И я вот, то есть я перешел на кафедру и работал инженером, и... я забыл твой вопрос, начальник. Мы говорим, я спросил, не скучал ли ты по... Не скучал ли я по веб-маркетингу. Не скучал, потому что, честно, не было времени, у меня была учеба и работа, и поэтому там это... и кафедра была классная. То есть у нас, правда, я благодарен своим учителям, потому что у кого учился, было довольно интересно. Хочу спросить про то, как ты изучал автокад. Во мне шутка просится наружу, и я пока ее не озвучу, я не смогу продолжать дальше. Ты знаешь, почему геометричка не попадет в рай? Нет. Потому что она чертила.\n",
            "The jokes, да? Вот это вот. Такие шутки. Меняем формат, давай. Всё, шутка пошучена. Расскажи про автокад. Когда у тебя встал выбор, чё, здесь руками или в автокаде, ты выбрал автокад, вас там учили или как? Прям вот этот компьютерный класс, в то время это ещё было, мы приходили в компьютерный специально оборудованный класс, где мы садились за компьютер, на котором стоит лицензионное ПО автокад, мы его запускали и, естественно, работали. И это было прям такое, ну, прикольно, это, наверное, первый touch IT в плане такого, именно то, что это программа. А как, кстати, я вот не знаю, но как рисуют инженеры? Мышкой или у них стилусы модные какие-то? Нет, мышкой, мышкой, всё происходит с помощью мышки. Но самое прикольное, они тоже как кодеры рисуют в тёмной теме. Типа, чертежи реально, ну, большая часть чертежей она делает на тёмном теме, для того, чтобы тебе глаза тоже не уставали, та же самая тема, и это типа секси, потому что это выглядит прям, такие тоже кислотные, ну, прям программисты, короче, то есть как у программистов, вот это там у меня там такое, цветовая схема у тебя такая, то же самое там, а у меня штрих-пунктёрную такой рисую, и вот это всё, это забавно. Понял, а значит, у инженеров тоже под три монитора может быть вполне, да? Нет, вообще не предел, типа, нет, три монитора, это там только начало, я думаю. Джун, инженер Джун, я понял. А как ты вообще про первую работу расскажи? Ну, то есть она как-то вообще спокойно прошла, без приколов тебя взяли, или как это было? Слушай, ну это я не знаю, как сказать. Нет, у меня была очень прикольная работа, в плане, она была супер нестабильная, я работал в очень маленькой компании, и я, ну, просто на Headhunter, ну, короче, где-то я нашёл объявление, что нужен инженер комитета, и сходил на собес, мне предложили 12 тысяч рублей, ну, типа, за половину рабочей недели, и я такой, типа, да, конечно, подходит. Подходит за какой-то год? Ну, примерно. 2008. Да, понял. Соответственно, и, ну, в общем-то, я замечательно пошёл на работу, у меня первый проект был, это роликанг для золотых слудитков, такая штука, которую пускаешь, вот в аэропорту встречаешь, когда у тебя перед, нужно чемодан протолкнуть, на роликах таких, вот то же самое, вот такой чертил штуку, с первого же дня рабочего, мне сказали, вот, сделай, я вообще ничего не соображал, сделал эту штуку, провели её тестирование, она сразу же сломалась, в первый же пуск. А расскажи, почему? Сейчас, как объяснить, показать, в общем-то. Это была такая штука, которая съезжает вот так, в общем-то, вот здесь подвал, окошко в подвал, здесь техническое помещение. И вот люди, они оттуда разгружают машину, скидывают сюда, это съезжает по горке, и потом прокатывается дальше по горке. И, в общем-то, вот это на этом стыке, на том самом, ну, как, я сделал аккуратные ролики, стоят со стоянием 15 сантиметров. Ну, хорошо, я уже как-то, я знал основу Agile, и я понял, что надо протестировать перед тем, как давать клиенту, и мы в цеху это дело собрали, взяли вот эту 16-литровую бутылку воды, короче, запустили её сверху, она по этому склону такая, и врезается в нижний ролик, и ролик просто пополам раздолбывается, типа, и у меня просто, ну, это типа, это literally, там, не знаю, вторая неделя рабочая вот такого формата, у меня там просто пот был вот так, меня сейчас уволят нафиг, типа, что мы будем делать, мы сделали всё неправильно, вот, ну, мы там пересверлили ролики, короче, костыли там тоже есть, ты просто такой, ну, просто сделал пару лишних отверстий, типа, сделали аккуратный, плавный съезд, всё сработало. Там заменили вот эту штуку. Да-да-да, ну, сделали, как бы, там, да, по радиусу, короче, физику немножко изменили. Подожди, а разве всякие автокады не делают это за тебя там? Не думаю, нет, к сожалению. Нет, к сожалению, за тебя не думают, нет. Ну, я имею в виду, мне казалось, какой-то сопромат есть, но это не совсем сопромат. Ну, разве нельзя в автокаде рассчитать, типа, подать вот в этой точке вот такая нагрузка, что будет? Можно, но это всё сложнее делается, и для обычных вещей обычно такое не делают. То есть, чаще всего тебе нет. Это я потом уже, там, освоил дзен всех этих вещей, можно было моделировать все эти вещи, но это время. Обычно ничего такого не делается. Да, я понял. Как и в продакшен. Вот именно так, именно так мы делали чаще всего. Вот, поэтому, ну, работа была забавная, ну, там, такая классическая, как, я не знаю, вот, я сейчас вспоминаю, ну, там, мне залежили зарплату, там, я не знаю, мне приходилось бегать за шефом, чтобы, мне в итоге, я так помню, до сих пор деньги должны, условно говоря. Ну, короче, ну, так. 12 тысяч? Я потом вырос до 15. У меня был рейс, типа, все, вообще чики-пуки. Да, я понял. Рейсы, это серьезно, в деньгах. Сколько ты там проработал в итоге? Слушай, я проработал там, вот, там очень похожие две компании были, они прям, почти одно и то же. Я где-то около года с небольшим проработал в одной, и потом еще столько же примерно в другой, в сумме 2,5 года занимался чертежами. Прикольно было кататься по заводам, мы много ездили по заводам, тоже такой свой отдельный мир, как перемещается, очень прикольно. Вот. Потом произошло, что, оказывается, надо сдавать экзамены. Универ заканчивался. Мне надо было писать магистрскую работу, ну, я потом планировал поступать в аспирантуру, и, в общем-то, я получше устроился в НИИ. У нас напротив МИИ есть ВИИ. Это Московский и Всероссийский электротехнический институт. И я устроился, собственно, в ВИИ работать, в классической советской НИИ. Вот если вы себе представляете как-нибудь в НИИ, вот оно такое. А ты смотрел внутри Лапянка? Там был инженер? Да, вот. Синий халат, я ходил в синем халате. Серьезно? Да, серьезно. У меня был такой халат, очень удобная штука. Прям такая, что ли. Что ты там делал? Ой, слушай, там я развлекался, я на самом деле до сих пор вспоминаю эту работу из одной из самых прикольных в плане гибкости. Ты приходишь в 10 утра, в 5 ты уже заканчиваешь. Укороченный рабочий день. Из него ты там еще ходишь на чай, пьешь, естественным образом. Шутки шутками, но там реально прикольно было. У тебя была задача придумать новую штуку. Какие-то были работающие задачи, ну, в плане, что нужно было, какая-то операционка. Но в целом, в основном, твоя работа заключается реально в таком R&D. Как себе представляют продуктовые власты менеджера? Я буду разрабатывать стратегию компании. Ты сидишь и разрабатываешь стратегию технического устройства. И мы занимались двумя вещами. Мы занимались сверхпроводимостью. Вообще, ой, жидкий азот, это тоже куча приколов с ним можно делать. Проводимость электрическая, имеется в виду. Да-да-да. Когда у тебя сопротивление провода в ноль падает, у тебя, по сути, ты можешь бесконечное количество тока пропускать, и это имеет свои спецэффекты. Вот. И, короче, сверхпроводимость электро... Ну, там тоже такая забавная штука. Мы делали именно ограничитель. То есть, когда ток превышает предназначение, сверхпроводник превращается в обычный проводник. И он таким образом может ограничивать сильно скачки тока. Вот. И вторая штука, занимались в том, чем я потом делал DCR, это управление вакуумной разряднике. Это как очень-очень мощные тиристоры или очень мощные полупродниковые транзисторы и так далее. То есть, это штуки, которые ты можешь включить. Ну, короче, это тиристор, по сути. Но он выключается сам каждый раз при переходе тока через ноль. Давай лучше объясни за тиристор. Я сделал вид, что это для аудитории. Я-то как будто бы знаю, но нет. Я тоже не знаю. У тебя паяльник под кроватью. Это правда, да. Ну, представьте, что вам нужно включить что-нибудь, что-нибудь включить. Есть такие устройства, которые вы можете подать на них сигнал, и оно включится. То есть, ток через него посечет. Но ток, он у нас синусоид развивается, и как только ток перейдет через ноль, прибор выключится. То есть, он запрется. И по идее, для того, чтобы вам его включать, вам надо будет каждый раз подавать рабочий сигнал, чтобы он включался. Вот такие приборы я делал. Только не... Ну, есть полупродниковые варианты, это тиристоры, а есть вакуумные варианты тех же приборов. Там ты пробиваешь промежуток вакуумный электрическим разрядом, и тогда он загорается. А в следующий переход через ноль, он гаснет. И вот тебе нужно их каждый раз запускать. Ну, они используются, в общем, для прессов, для всяких вещей связанных. Нужно очень быстро повысить очень мощный какой-то ток. Прикольно. Не думал никогда об этом, но теперь подумал. Еще подумал, что это хорошая штука, чтобы иронизировать... Я замечал, что люди, когда учатся в IT, хотят, они начинают типа, а вот мне нужно еще чуть глубже обучиться, и там, типа, я над ними обычно иронизирую, что вот питон, тогда за питоном давай изучать более низкоуровневые. Там мы дойдем до ассемблера. Ассемблер стоит на логических вот этих операндах. Орксор. А вот так мы и до тиристоров сейчас дойдем. В общем-то, вот они, да. Пока не выучишь тиристор свой, не сделаешь никакого аналитика, тебе нельзя. Все. Точно. Ну, и ты написал там работу в итоге, все получилось? Да-да, я написал диссертацию, защитился, получил свой кандидат в технический наук. О, погоди. Поэтому, как бы, печки. Слушай, как это, к сожалению, не особо пригодилось, в том смысле, что я правда планировал заниматься наукой, мне очень нравилось это, но заниматься наукой, к сожалению, имеет свои дробайки. Как говорится, есть минусы, денег мало платят. Вот. И там тоже были сложности с тем, что, так скажем, там тоже перетрубация, короче, наши институты объединялись другим, туда-сюда, и я решил, что надо сегодня еще попробовать. Так. А ты уже закончил, все, ты кандидатом стал и перестал работать там или не перестал? Технически получилось, что я диссертацию написал, потом ушел, а защита у меня просто была чуть позже, вот. Но я уже закончил диссертацию, закончил аспирантуру. Вот. Короче, это интересная история, сейчас почему не обращу внимания, потому что сейчас много ребят, кто приходит в IT, они меняют профессию. Я свою карьеру поменял два раза в профессии, можно сказать, даже три, наверное. Вот. И у меня был такой первый фазовый переход, я перешел из такого инженера слэш научного сотрудника, там какие-то были очень похожие задачи, чертежи исследований и так далее, в роль бизнес-консультанта. Расскажи, как это вышло? Ой, всегда вам рассказывать историю, как правильно, как будто я подумал и придумал это, или как на самом деле произошло, типа, по факту. Мне бы хотелось послушать, как произошло, если... По факту очень смешно. Есть компания «Шнидролектрик», они занимаются электрическими аппаратами. И я тоже у них работал, приглашал преподавателя какое-то время, и у них был семинар на тему бережливого производства. Я туда просто пришел и послушал про эту тему. Бережливое производство – это история, похожая на Agile. Ну, в общем-то, все методологии оптимизации бизнес-процессов, Agile, 6Sigma, бережливое производство, не знаю, в общем, там... Их очень много, Toyota Production System, в общем, это все про одно и то же. И, в общем-то, там я увидел, что, оказывается, можно работать нормально, а не через жопу. Потому что меня всегда подгорало, и когда я работал в производстве, и когда я работал в НИИ, что все делается очень странными путями. Ну, типа, а что, нельзя заранее было подумать? Вспоминается твой этот... Да-да, ну, нет, серьезно, там много было всяких кейсов, когда, не знаю, мы что-нибудь перепутывали, что-нибудь взрывали, что-то забывали выключить, короче, в общем, и такие вещи, ну, как бы... Ну, это какие-то мелочи привожены, еще много было процессных проблем. Не вовремя привозили оборудование, не вовремя какие-то делали вещи, и так далее. И мне казалось, что, типа, there must be a better way. И как раз мне рассказали предприимчивого производства, я такой, нифига себе, можно, типа, делать нормально, по-человечески. И я... и это вот первый прикольный лайфхак, который, мне кажется, слушать им будет полезен, это история про то, что я эту штуку не... Многие сейчас делают такие, все, я сейчас уволюсь и буду, блин, аналитика данных учить. Камон, типа, куча рисков. Ребята, вы можете не найти работу, вам может не понравиться, еще чего. Я начал потихонечку у себя на работе это применять. То есть я нашел бесплатные курсы, я нашел литературу, почитал поэта и начал у себя на работе, собственно, в НИИ, на производственных процессах каких-то применять оптимизацию бизнес-процессов, ну, типа. Сделал из этого пару кейсов, и у меня уже, когда я дальше искал работу, у меня уже был не просто чувак из НИИ, который ничего не понимает, а у меня уже была некая сертификация, там есть определенное, ну, короче, обучение, что я прошел. И были кейсы. Что оптимизировал процесс. И как бы они... Они были не совсем настоящие, ну, как бы настоящие, но в реальности, если копнуться, конечно же, я один сам что-то делал. Я сам себя оптимизировал. Вот, молодец, классное, классное ты сделал. Вот, и поэтому они были такие полунастоящие, но я реально пощупал. И здесь, мне кажется, очень два важных штуки. Ты, во-первых, получаешь уже реально готовое портфолио, когда ты захочешь менять профессию, и оно будет, вообще говоря, релевантное. И второе, ты поймешь, нравится тебе или нет. Потому что, мне кажется, многие ребята попадаются в ловушку, такие, все, я уволился, сейчас я буду учить, я поставил на аналитику данных, а потом ты понимаешь, что не идет, вообще не хочется. И ты себя заставляешь, но у тебя уже, как говорится, нет пути назад. Вот, поэтому я постепенно начал применять инструменты биржевого производства на работе и попал в японскую консалтинговую фирму. Добрый гол. Это просто тоже называется Kaizen Institute. Это японские ребята, точнее, есть такой Масаки замечательный гуру этого всего дела. Он основал компанию и, в общем-то, по всему миру занимается консалтингом. По сути, консалтинг такой же классический, как, не знаю, большая тройка или четверка, но он очень узкоспециализированный. То есть это консалтинг для производственных фирм в основном и консалтинг именно по этой методике.\n",
            "биржевого производства и лину, повышение оптимизации. Вот, и я пришел в ту компанию, до сих пор помню это собеседование было очень забавное. Я завалил кейс, я потом понял, что я его завалил, причем не сразу, типа через месяца три, когда меня уже на работу взяли, я понял, что я вообще неправильно ответил. Вот, там был кейс-собеседование, я уже не знаю, что мне понравилось руководителю, ну, в общем, сказал, ладно, типа, вроде соображаешь, поехали. А как, что завалил-то, что спросили, что сказали? Сказали, вот представь, давай, вопрос к тебе. Я на кейс-собеседовании. Да-да-да. Кока-кола, завод, стоит машинка, едут бутылочки, бутылочки едут, в смысле конвейер, ну, который их, не знаю, разливает и закупоривает. А, понятно. Вот, она стоит и работает. Твой вопрос к тебе, как понять, что можно улучшить, и, в общем-то, что можно улучшать в этой машинке с ее работой. Ну, как она работает. Задачный дизайн-метрик. Да-да-да, по сути, да, по факту, в итоге. Ну, что там можно улучшать? Ну, я бы начал с простого, сколько раз она вообще встает, падает с какими-то ошибками, и эту метрику сначала минимизировать. Дальше, какой-то саксес-рейтинг, надо уметь ей научиться считать, где-то она фейлит, где-то она делает неправильно. После саксес-рейта и минимизации ошибок. Все, все, не выпендривайся. Черт, я аналитиком работал, а ты что сказал? Ой, слушай, я, ну, а я как раз, мне кажется, джиновскую ошибку сделал. Я пошел применять, ну, ты сейчас все правильно рассказываешь, там есть специальная метрика, называется overload-fueled-on-deficiency, это, в общем-то, такой у нас теоретический, может быть, выход с машины, тон бутылок в час, и насколько она по факту производит. И дальше ты раскладываешь, ну, ты все правильно описываешь. Вот, я, мне кажется, сделал джиновскую ошибку, и я пошел рассказывать о том, я не понял, что это такое, ну, не знаю, какая метрика, не знаю, что там делать. И я такой, ну, можно применить инструмент такой, там, 5S, ну, это опять, короче, это как джун, который начинает прикладывать любую библиотеку питоновскую к решению любому, там, типа, я бы открыл нампи, там, типа, табло открыл, короче, типа, что-нибудь бы делал. Я то же самое, я только, ну, то есть методику какую-то предложил, но не понимая конечного результата. Вот, поэтому, да, в общем-то, аналитическое просто не пропьешь. И, кстати, вот тоже интересный кейс, что, в общем-то, если вы аналитик хороший, то вы можете с любой такой задачей справиться, поэтому, мне кажется, классный опыт. Да, тебя взяли работать, но несмотря на это. Да-да-да, меня взяли. Вот. Чем ты там занимался? Вот твоя работа, что это было? Что делать? Приезжаешь к клиенту и делаешь вид, что ты умнее его. Ну, мы ездили по заводам, реально, то есть ты приезжаешь в какую-то компанию, не знаю, там, производство троллейбусов, производство подсолнечного масла, майонеза, строительная компания какая-то. Твоя задача проанализировать бизнес-процессы, и они такие бизнес-процессы, не как вы привыкли, там, типа, письма посылаются, еще что-то, а это вот там, иди, посмотри, как Петрович гайку на 16 затягивает, вот такого формата бизнес-процесса. Ты анализируешь эти бизнес-процессы, они часто реально физические, из физического мира, ты смотришь о том, как работают люди, что они делают, и потом твоя задача, в общем-то, его оптимизировать. Ты должен сказать, что ой, давайте мы Петровича переставим на 5 метров вправо, ему не придется ходить каждый раз за ключом на 16 и так далее. И там реально такая оптимизация супер понятная обычно, ну то есть она такая очень, я не знаю, почему люди ее не используют, ну то есть там обычно просто здравый смысл, очень простой здравый смысл, нет никакой магии, вот, и ты вот таким образом помогаешь компаниям повышать их эффективность производства. Плюс там часто это сопровождалось обучением, то есть мы делали это вместе обычно с инженерами, с компанией, их обучали этим методикам, вот смотрите, давайте, вот это тоже приходит к визуализации, как говорится. Мне очень нравилась диаграмма Спагетти. Ты, короче, берешь листочек, и человек куда-нибудь ходит там, например, ты берешь ручку, ставишь, куда он ходит, и следишь, рисуешь, вот как он ходит по помещению во время работы. И оказывается, что люди просто, вот мой самый любимый пример, пекарь. Как думаешь, сколько метров прошел пекарь за час? Понятия еще не имею, зависит от того, какого размера цех, в том помещении его в целом. Когда ты думаешь о профессии пекаря, ты думаешь, что чувак стоит на месте, ну, плюс-минус. 890 метров, ты такой, типа, ты километр куда-то ходил, типа, come on, что происходит? Гулял, что ли? Ну, то есть, серьезно, вот. Или мой любимый, потом я в банке работал с таким же кейсом, и там, типа, операционист, он должен ходить, что ли, куда-то, а он ходит за принтером, где принтер? На другом этаже. Ну, как бы классика просто, типа, классика. Вот, поэтому там часто... Ты рисовал руками такие штуки? Да, и это тоже очень круто. Ты, когда, кажется, визуализируешь, ты визуализируешь физическую реальность. То есть, в отличие от того, как мы с вами визуализируем какие-то часто абстрактные вещи, там ты визуализируешь прямо физическую реальность часто. Вот, это было бы прикольно. Ну, и, по сути, там тоже есть аналитика такая, обычно довольно простая, но какая-то есть. И тоже есть свои метрики и так далее. Симметрики очень забавные, у меня есть вот тоже у тебя загадка. Завод по производству кевлара. Кевлар – это такие жилеты, из которого делают, и кевлар – это изначально тонкие-тонкие, типа, нитки. Вот, и, по сути, это стоит химическая штука, из которой капает тоненько эта химия, она застывает потихоньку и дальше вытягивает, как веретено. И это ведет через кладский станок, эта штука. И вот такой завод, такая техника производства, и у них есть KPI. KPI по безопасности в цеху. Какие у тебя есть идеи, какой мог быть KPI по безопасности? Не знаю, зеро идей. Ну, короче, это вот вопрос правильно выбранной метрики. Это у них количество отрезанных пальцев в год. Вот, соответственно, как бы, проблема в том, что этот кевлар, он часто соскальзывает с ролика, и его надо поправить обратно. Они часто ленятся специальным инструментом или машинным инструментом, потому что у них от выработки зарплата зависит. И они такие, ну, сейчас я накину пальцем быстро, и, короче, пальцы часто... Минус палец. Жесть. Вот, поэтому забавно. И тоже дэшборд висит, как бы, на входе в цех висит, ну, он такой бумажный просто, там это, ну, как бы, есть, пожалуйста. Просто без отрезанных пальцев. Да-да, вот это классика жанра. Поэтому свои там есть приколы. Здесь сидел на прошлом выпуске Вася Собиров, он что-то шутил про токарей или кого-то, и он показывал, говорит, и вот токарь мне говорит, пять! Ну, да-да-да-да-да. Жесткие производственные шутки. Не, ну, сверх успехов, но я, да. У меня знаешь еще какой вопрос был про визуализацию? По сути, ты говоришь, что там визуализация того, к чему я ходит, это же граф. Да, да, можно сказать, да. Прикол. Вершины, ребра, все прямо вот. Да-да-да, можно посчитать, да. Причем это мы делали, ну, как бы, в простую, а в современных условиях это реально вешают трекеры, такие же, как вот вы пользуетесь, в Макдональдсе вот эти трекеры, буйки, да? Да. То же самое на людей внутри цеха. Это, я не помню, как там, пресижн, что-то там, трекинг, бла-бла-бла. И физически, автоматически замеряют эту метрику, сколько человек прошел во время рабочего дня, и как это строят, поэтому прям уже дешборды и всякое такое, ну, нормальные. Но прикол в том, что чаще всего выхватает и вот просто пойти руками прессовывать. Короче, сразу видны чугдейские проблемы. Вот. Я же занимался такой историей, консалтинг, очень интересно, если вдруг вы захотите получить много опыта, консалтинг, это реально прикольно в этом смысле. Но там есть все свои минусы. То есть я вот опять же, командировки, работа по 12 часов, вся история, все это присутствовало. Но реально там за полтора года работы ты просто, типа, ощущение, что побывал, не знаю, в куче проектов разных и так далее. Это очень интересно. Ну, это, кстати, прикольно, да, правда. Не было такого, что прикипел к проекту, а вы с него сняли. Сняли и кончился. Не, были истории, мы часто дружили с ребятами, с кем работали, то есть если проект был долгий, то ты, по сути, работаешь внутри заказчика, и ты просто как с коллегами. Поэтому такая грусть иногда была по завершению. Иногда было облегчение. Потому что однажды я делал проект, например, для магазина спецодежды, и собственник магазина явно имел какое-то криминальное прошлое, мне кажется. И я боялся реально за свою жизнь, потому что там была такая история, что, в общем, я пришёл в цех, наблюдал всё это, выхожу из цеха. Сейчас бетон кого-то закатали. Не про тебя. Хуже, если честно. И я такой пришёл, типа, мужики, здорово, я просто последить, ничего такого, туда-сюда, мне же надо с людьми общаться и так далее. И потом я выхожу из этого цеха, и стоит этот собственник, стоит начальник цеха, и он говорит мне, ну что там, как, что там? Я такой, ну вот здесь можно, да, чуть-чуть поправить, вот здесь можно переставить оборудование. И, короче, этот собственник выхватывает мне бумагу, а там ребята стоят, курят недалеке, с которыми я только что общался. Он говорит, так я и знал, уволить их всех надо нахер. Я такой, а мужики такие на меня. В общем, забавно, да. Ну да, нет, разные проекты бывали, но очень смешно, прям такой куча опыта. Я до сих пор очень благодарен. Это всё в каких регионах? Это по России разбросали? По России нет, где только не был, не знаю, Нижний Новгород, Саратов, Ростов-на-Дону. Один раз ездил в командировку в Якутск, минус 52 в январь, короче, вау. Жёстко. Прям такие вещи. Понял. Сколько ты там проработал в итоге? В итоге я там проработал, на самом деле, не очень долго. То есть если я в инженерной отрасли 5 лет суммарно отработал, то здесь я проработал 2-2,5 года. Я перешёл потом работать в банк. Ну, у нас был проект в этом банке, и я просто классика жанра, меня выкупили. И это, наверное, было одно из самых плохих решений с точки зрения карьеры. Я ничего не хочу сказать про банки, но я больше в банке не поднимаюсь. А почему? Расскажи ещё, что там. Слушай, я не знаю, может, я правда боюсь как бы создать... Неверный образ? Неверный образ, да, потому что это может быть связано конкретно с моим опытом, с каким-то вообще и так далее. Довольно жёсткая культура, ну, то есть она при этом очень сильно такая вот подковёрная, много своих интересов все хотят учитывать и так далее. Вот. Очень медленно, очень всё зарегулировано, очень сложно менять. Ну, то есть ты уже в этом случае, мы уже чаще меняли процесс не физически, а какие-то связанные с IT, уже там как заявки проходят, как автоматизироваться и так далее. И там всё зарегулировано в ЦБ, какие-то очень старые ПО какое-то, очень много с этим проблем, и там ты такой, а можно вот здесь наш операционист не будет вводить это, чёрт побери, четыре раза, а просто один раз введёт, и это всё автоматом откопируется. Ну, это доработка на полгода. Что происходит, короче. Вот, то есть довольно сложные, тяжёлые процессы. Мне было не очень приятно работать именно в такой культуре, короче, поэтому я там довольно перегорел. А ещё я там, если я работал прям совсем в консалтинге, то всё-таки ты как раз такой, это классная прикольная позиция, потому что ты такой приезжаешь, такой, хей-хей, чуваки, всё тут правьте, я тут уехал, короче, разбирайтесь, я на коне, короче. Хочешь крутые советы, раздаёшься, так. А тут ты уже ответственный за результат. Приходится работать. Не только работать, приходится общаться с людьми, а я понял, что я людей не очень люблю. Ну, то есть по факту в итоге ты, когда меняешь процесс, ты думаешь, да, окей, ты можешь там, я по-другому настроил время так, ты разбил операции, всё там нарезал так, что это синхронно работает и так далее, но в итоге это делают какие-то люди. И чтобы они это сделали, тебе нужно их прийти, обучить, убедить и так далее. И по факту ты в итоге меняешь не столько, ну, и бизнес-процессы, и мейнсет людей. И вот изменение этого мейнсета людей для меня всегда было сложной историей, потому что я всё-таки такой больше интроверт, чем экстраверт. Ну, как будто бы твой евангелизм BI тоже самое подразумевает, нет? Ты же ходишь и говоришь, ну-ка, дешево ты делай. Да, но здесь мне нравится, как сама идея, и поэтому я её сильно горю. То есть, возможно, там не так сильно горела идея, что это стоит делать. Второе, всё-таки меняя операционные процессы, ты больше самодействуешь с людьми, которые не очень-то мотивированы к изменению процесса. И они обычно это воспринимают как раз как какую-то угрозу для себя и так далее. Да, что-то приходит, что-то надо, и он как-то меняет. Не, ну серьёзно так. Там же тоже такая проблема классическая, что когда ты оптимизируешь бизнес-процесс в компании, ты оптимизируешь обычно количество ставок. Ну, ты людей увольняешь, по факту. И это люди не любят, когда их увольняют. Поэтому с этим бывает тоже проблема. Ну, короче, для меня это немножко разное. Опять же, я до сих пор так же не люблю, не знаю, упрашивать программистов, которые что-то не делают. Или, короче, не знаю, бодаться с юристами насчёт каких-то особенностей и так далее. То есть такого формата скорее. Понял. Слушай, у меня про банк вопрос. Это был какой-то банк, который мы все знаем, он на слуху? Или это типа там... Ну, он входил в топ-10. Псковский? Нет, большой банк. Понял. Хорошо, ладно. Ну, в топ-10 входил, да. Окей, хорошо, спасибо. Так, и что, как ты ушёл, куда ты ушёл с банка и почему? Это, наверное, первый раз, когда я перегорел прям так серьёзно. Ну, то есть я прям вот типа выгорел, и я угорелся никуда. Вот, и я пытался что-нибудь найти. И здесь мы попадаем как раз в эту классическую историю, как перейти в IT, потому что я вообще-то в этот момент перешёл в IT. Я стал смотреть, что сейчас популярно, о чём оно, что интересно. Стал думать, что мне интересно. Ну вот, было очень много...\n",
            "всяких историй про ML, аналитику тоже данных. Какой это год? Ну, 16-15 год. Какой формат? 16-17, скорее даже. 16-й, не важно. Whatever. И так как у меня всё-таки было техническое образование, я умел чуть-чуть кодить, я кодил на сети шарпе контроллеры для стендов в ней и так далее, я решил, что надо что-то такое где-то рядышком посмотреть. И опять, как всегда, какая-то красивая история для чаров, я понял, что я хочу совмещать аналитическую часть еще с чем-то и так далее, и тому подобное. Реальный ответ, что у меня жена устроилась работать дизайнером в компанию, и там у них как бы одна из сотрудниц этой компании проводила курс по визуализации данных, и я его случайно посмотрел в интернете и понял, что это такой типа чпок. Классно, прикольно, интересно. И дальше забавная история, потому что у меня была первая попытка войти в IT неудачная. Типа опять же, немножко как тем, кто сейчас пытается перейти в отрасль, не всё получается сразу. Я начал именно заниматься кодевым визуализацией, то есть это на фронтовых технологиях, на JVC, на HTML и CSS, я стал кодить визуализацию. Опять я применил свой же лайфхак, я не стал это делать просто. Ну, кстати, да, вру, я уволился чуть позже в никуда, я начал это ещё делать чуть раньше в банке, я стал это применять. И даже потом, когда я уволился, я ещё сделал свой мини-пэт-проджект, который до сих пор на самом деле живёт, и там тоже кодил. Ой, сори, немножко сумбурно получилось, но не важно. В общем, история про то, что я стал пытаться быть разработчиком. Да, ты начал делать, по сути, рисовалки графиков. Да-да-да. На вебе. На вебе, на D3JS библиотеке, и я таким образом подал заявку в компанию лаборатории данных. Лаборатория данных – это моё, наверное, любимое место работы, где я работал в итоге потом. Ребята искали программиста, такого прям, программиста. Чтобы он писал фронт для визуализации. Ну и, короче, я совершил вторую ошибку. Я подумал, что за три месяца можно научиться работать. Ну, то есть, ну сколько я… Я покодил месяца три, ну, может, четыре как раз такого формата. И подал… Ребята выдали тестовое, у них было тестовое общедоступное, и я его сделал. И я сейчас, когда смотрю, как я его сделал, это просто смех и слёзы, потому что это костыль на костыле, и просто, ну, реально чувак вообще ничего не умеет, просто чё-то на кожу, короче. Не, ну, работаешь как раз. Работаю, работаю. И ребята на это посмотрели, они такие, слушай, работает, но мы вообще в работе используем фреймворки. Фрейм… что? Типа, ну, фреймворки, там, ангуляр, знаешь же. А, ангуляр. Ребят, сейчас переделаю, короче. В общем, и я взял у них ещё доп. месяц, и говорю, ребят, сейчас за месяц ангуляр выучу, короче. Тоже наивный чукотский юноша, короче. Я в итоге переделал этот ангуляр, но это всё равно, на самом деле… Ну, опять же, сейчас ты понимаешь, что это всё равно было не очень хорошо сделано. Им отправил, они на это ещё раз посмотрели, сказали, слушай, Рон, ты классный парень, мы видим, что ты усердный, ну, типа, извини, но как бы ничего не получится. Да. Вот. И я остался без работы, я остался, в общем-то, я уже уволился в этот момент, и я, в общем-то, что я начал делать? Я начал вести блог в это время. Я завёл блог, я такой, типа, ну, буду пока чё-нибудь фигачить. Кстати, вот мне интересно, что у меня было в этот момент с деньгами. Ну, видимо, у меня был какой-то запас денег, потому что я как-то судорожно работу не искал почему-то, хотя, наверное, стоило бы, не знаю. Ну, короче, и я начал вести блог и начал делать визуализации. В общем-то, я сидел, кодил в своё удовольствие, типа, летом я, ну, я решил, что, типа, я за лето вот чё-то покажу, и потом чё-то буду уже искать. Вот. Ребятки у меня вернулись с предложением, они вернулись с предложением, а давай сделаем совместный проект, где ты побудешь именно заказчиком. И я выступил в роли, мы с ними сделали визуализацию данных для производства. Мы как раз сделали дашборд для производственной компании, ну, как бы, где я, типа, побыл заказчиком. А я не понял, им это зачем? У них была такая рубрика, они делали прикольные проекты просто с вами тоже, типа, читателями блога и всякое такое. А, понял. И для них это был прикольный кейс в портфолио для того, чтобы показать, что у них есть разные вещи. Ну, да, как шаблон, типа, можно было для вас, да, понятно. И, как бы, они увидели мою экспертизу, что у меня была экспертиза по производству и туда-сюда, и вот мы с ними сделали дашборд, прикольный дашборд, он до сих пор ко мне приходит, и вот к ребятам приходит, типа, зато делаете нам такой дашборд. Короче, он есть в интернете, и я там исполнил роль заказчика, и, по сути, так как был таким заказчиком, который ещё немножко менеджерил команду, на самом деле, и ребята, наверное, всё дело посмотрели и говорят, слушай, давай ты у нас будешь менеджером проектов. И я в итоге попал в команду и в IT не программистом, не кем-то, а просто пришёл руководить командой, там было несколько дизайнеров, было несколько разработчиков, и я в итоге руководил проектами по визуализации данных. О, прикольно. Вот. Поэтому я, как бы, в IT попал, но как это, через backdoor, короче. Не тем, чем хотел, учил-учил свой код, нифига мне код для работы не пригодился. Вот. И я потом работал в компании 2 года, мы занимались разработкой очень крутых, сложных сервисов по визуализации данных. Суперкоманда была, небольшая команда, мы делали очень сложные вещи. До сих пор считаю, что прям, ну, типа, вообще одна из самых сильных команд была по визуализации, и много научился самой визуализации данных. То есть, по сути, только в этот момент я, ну, вообще-то понял, как это работает, вообще, как графики строятся, как они хорошо, что хорошо в них, что плохо. И я на это смотрел со стороны, и много работал с дизайном. То есть, я, по сути, ну, в каком-то смысле выполнял такую роль арт-директора в плане логики. То есть, ребята очень ценили, потому что у меня такой бизнесовый и технический бэкграунд, и я мог очень много осечь всякого булшита на входе, когда там, не знаю, там, ну, я сейчас словом говорю, но дизайнеры такие, о, а метрику, эта метрика может уходить в минус. И такой, нет, не может, физически не может, типа, камон. Вот, и поэтому много работал с дизайном, и научился вот в этот момент как раз, типа, визуализации данных с точки зрения именно то, что сейчас умею. Научился как раз, по сути, знаешь, как это, тайком по вечерам тоже, помимо управления ребятами, просто впитывал, что ребята говорят, и еще продолжал кодить, и продолжал что-то искать. А что-то искать, тебе хотелось быть все-таки разработчиком? Слушай, меня всегда загорало, у меня всегда большой разрыв между, короче, мне хочется видеть результат своей работы, и когда ты руководитель, ты его видишь очень непосредственно. Тебе его сложно атрибутировать на себя, и ты кайф не так ловишь. И мне хотелось что-то руками делать, короче. И я как раз случайно остановился на Tableau. И я принес этот инструмент к нам в компанию как инструмент прототипирования. Вообще тоже, типа, совершенно, скажем, нестандартное его использование. Мы прототипировали на базе Tableau интерфейсы, ну, с визуализацией естественным образом, а потом давали разработчикам, разработчики это переводили уже в web, и я как бы просто оптимизировал таким образом процессы наши. То есть я это придумал с точки зрения, что а, я что-то могу поделать руками, б, блин, давайте, типа, не будем рисовать кучу макетов, потому что очень сложно на данных рисовать макеты, а будем это сразу вживую пробовать, там, где можно пощупать, потыкать и так далее. Слушай, я почему-то думал, что компания, которая занимается промышленным, ну, изготовлением дэшбордов, у них какая-то биосистема есть, не каждый раз голый веб фигачит. Не-не, это как раз, мы по сути разрабатывали биосистемы, только очень обычно мускоспециализированные. То есть это аналитические системы, например, для анализа генома кишечных бактерий. Типа, есть ученые, у которых есть свои стандарты данных, которые там особенным образом хранятся и структурируются, им нужны системы-аналитики по этой штуке, ты их не можешь в табло загнать, эти данные. Тебе нужно специально... Данные загнать можно, другое, что с ними ничего не сделаешь. То есть, наверное, такие штуки делали. Или делали системы-аналитики по ценным бумагам, но по облигациям, не по акциям и всякому такому, что сейчас часто есть, а по более долгим, таким, инвестициям и так далее. Вот, поэтому, да, то есть, ну, это специфика компании была. То есть нет, обычно, да, обычно никто не делает бяйку с нуля, а мы делали именно не бяйки, а такие специализированные аналитические системы. Да, все, теперь понял, хорошо. И ты там притащил для прототипирования табло. Да, табло. И таким образом, случайно, как раз у нас потом я... мы проводили тоже учебные курсы с ребятами, и я предложил им, как бы, давайте я вот там часть табло впихну в этот учебный курс, и там был один из слушателей этого курса, который меня потом пригласил к себе в компанию, мы с ребятами делали SAS аналитическое решение, и вот по сути, давайте только сейчас, как это все будут, наверное, ну, это точка, когда я начал заниматься чем-то рядом с BI, ну, то есть это случилось относительно недавно, ну, то есть как бы 5 лет назад, может быть. Да. Вот, и я перешел в компанию, которая делала уже полностью аналитику классическую для фармкомпаний, но с использованием табло. То есть там вместо фронта уже такого было табло, и мы были что-то среднее между SAS и аналитическим агентством, то есть где-то мы выдавали людям просто год обработки данных и вот готовые дэшборды, а где-то мы делали какие-то исследования, эпхоки, дополнительные какие-то данные подтягивали и так далее. Вот, тоже классная компания, то есть такой, ну, тоже бутиковый бизнес, вот мы под одну только отрасль, под фарму делали конкретную отчетность. Это интересно вообще, сколько всего оно существует. Я почему-то думал, что у фармкомпании ин-хаус аналитика, им ничего не надо. Очень смешная история, это тоже, вот, у меня этот дуализм всегда, у нас с вами чаджи пяти на одной руке, и, типа, какая-то икс-элена и всякий бред на другой. До сих пор, когда ты фармкомпания, ты там делаешь таблеточки, тебе их нужно продавать. Ты их продаешь дистрибьютору, дистрибьютор их продает аптечная сетя, аптечные сети продают уже конечным пользователям. И аптечные сети не очень любят делиться данными с производителем, и у тебя возникает разрыв. Ты производитель, но ты не знаешь, кому, что, где, кто продал, за сколько, когда и так далее. И поэтому производители заключают контракты с аптечными сетями, чтобы те подставляли им данные. И эта подставка данных, это просто, типа, это прям все, что ты можешь себе представить. XML, CSV, JSON, а вот у нас здесь API к битриксу, а вот здесь у нас это. Да, понятно. Ты большая фармкомпания, и у тебя 200 контрагентов, и тебе раз в месяц 200 людей присылают в разном формате. Полный bullshit. Потому что, ну, это смешно, пока как это. Ты столкнешься, что там, короче, кто-то вбил бухгалтер Небулин номер 32, как Небулин номер 34, или там, короче, что-то такое. И это, ну, мы очень много занимались обработкой данных, чистингом, клинингом, привязкой к мастер-данными, и вот это все. Поэтому, то есть, вот мы именно на основе этой, по сути, аутсорсили, потому что это та штука, которую ты невозможно держать in-house. Да, понятно. Мы, за счет того, что у нас было несколько клиентов, мы могли ее автоматизировать и оптимизировать. Потому что одна компания такой просто не потянула бы. Жестко, да, теперь понятно, зачем это. Ну, потому что я… У нас был AI, который умел разбирать Excel. Это тоже отдельная разработка прикольная, он такой instructor-led. То есть, были специальные люди, которые размечали цветом ячеек, мне так нравится это решение, цветом ячеек размещали, где какие-то типы данных хранятся в Excel, потом натравили машинку, эта машинка понимала по цвету ячеек, какой паттерн, и потом все остальные эти он уже автоматом обрабатывал. Там тоже, короче, свой отдельный мир забавный. Вот это прикол. Опять же, просто с точки зрения оптимизации бизнес-процессов. А у фарма-компании недостаточно власти, чтобы немножко директивно сказать, вот сюда, в таком формате. Слушай, они денег за это платят аптечным сетям, я вообще до сих пор офигеваю, что ты такой, ты платишь за то, что тебе рассказывают, как твои товары продали. Ну, то есть, там очень странная, мне кажется, история. Сейчас на государственном уровне вводят маркировку, и эту штуку позволят делать сквозную… вроде как, должна позволить сквозную аналитику делать, но пока ее… То есть, это только на госфору не могут делать такие вещи. Да, понятно. Появится, знаешь, какая-нибудь Яндекс.Метрика для таблеток. Ну, вот она, типа… Среза можешь ставить там. Окей. Слушай, класс, прикол. Ну, тебе нравилось это с таким колыбацией? Как ты вообще в этом был? Ой, слушай, я вот работаю… Ну, тоже я к ребятам вышел, я вышел на позицию персонального директора, потому что… Вот это у меня вечный дуализм, естественно, тоже, не делайте моих ошибок, делайте, что вам нравится. А мне как… у меня была всегда история, что, типа, хочется какого-то статуса, хочется какой-то, типа… Директора, да. Типа, хочется людьми управлять, ну, камон, типа, что-то такое делать. И когда меня ребят к себе позвали, я с ними сначала немножко поработал в формате фриланса, такого просто, ну, консалтинга. И потом я говорю, ребят, я к вам приду, только если у вас будут другие процессы, потому что у них процессы были не очень. И они говорят, ну, иди и сделай сам. Ну, я такой, типа, ну, конечно, короче, окей. Громкая должность, хорошая, типа, команда. И после этого я, типа, говорю, что, пожалуйста, я данные больше никогда не хочу работать с данными, с очисткой и приготовкой. Потому что всегда какой-то трэш постоянный. Пайплайны всегда падают. Всегда что-то не доезжает. Всегда где-то ошибки в данных. Где-то какие-то форматы меняются. Ну, короче, шутки шутками, но, в общем, то есть я у ребят выступал в роли такого, ну, тоже, видишь, мне забавно. Я, ну, действительно много делал операционки, связанные с данными, и потом как, типа, на остаточек я проектировал систему дэшбордов, и там много делаю сам руками, либо делегировал аналитику, но уже занимался такой, скажем, работой, которая нравилась. То есть созданием системы отчетности для фармкомпании. Но это вот такой был микс. И поэтому, ну, короче, это было прикольно, но это было очень сложно. То есть там много чинских...\n",
            "с клиентами, которые недовольны тем, что им не приехали данные, тем, что что-то не обновилось. И я такой, типа, о боже, бедные дата инженеры, типа, вот это все, короче, прям очень сложно. Вот. Черт, мы уперлись в лимит безлимитной вертики. Типа, что делать? Типа там, короче. Слушай, лимит безлимитной вертики – это что-то из мемов. Это может быть хороший стикер, знаешь, вот стикер для ноута, на конференциях раздают обычно. Это, может, хороший стикер. Лимит безлимитной вертики. А какой лимит безлимитной вертики? Это бесплатная вертика на хранение там, по-моему, сколько-то миллионов строк, пускай не бесплатно. Ну, почему не Гельхаус? Или тогда его еще не было? Ой, слушай, там я еще как-то… Не дошел до него. Ну, там был у нас дата инженера, которая выбирала решение, придумала по этому поводу, я как, типа, вертика, вертика. Ну, вертика лучше работает с табло напрямую, поэтому есть нативный драйвер отчасти тоже поэтому. Понятно. Так, сколько ты там проработал? Слушай, я проработал там два года. Мы, в общем-то, из прикольного мы запустили. Это то место, где у меня родилась вот эта моя концепция системы работы с дэшбордами, дэшборд мэп, когда, оказывается, можно дэшборды делать разному типа, по-разному делить, и их можно после этого связывать. И я прикольно там, так скажем, опробовал ее на разных компаниях. То есть мы сделали стэк дэшбордов, которые раскатывали на разные компании, и показывал, что, опа, нифига, он работает более-менее хорошо на всех. И у меня отсюда возродилась идея как раз такой системного подхода к работе с отчетностью с дэшбордами. Я там это попробовал, катал, и однажды мне написал в личку Женя Козлов. Был пару выпусков назад, сидел здесь и так. Женя был здесь, и Женя, привет тебе, и, в общем-то, спасибо, что мне тогда написал. И Женя написал, типа, в каком-то чатике, по-моему, в чатике Никушина про заплатующих аналитиков, скинули какую-то визуализацию из моего блога. Ну, то есть я продолжал вести блог, не шепка, не вялка, что-то делал, какие-то проектики, ну, чисто для себя. Вот, и кто-то туда кинул мою работу с табло паблика, и, типа, Женя у нас зацепила. Я до сих пор всем показываю, это работа про температурный рекорд России. Там вообще, типа, ничего не связано, это более-менее инфографика, ну, то есть не какой-то бизнесовый дэшборд.  Но он, короче, мне решил что-то написать. Вот, я ему написал, типа, привет, давай пообщаемся. Я помню, как я это, соскринил сообщение, послал другу, мне кто-то из Яндекса пишет, короче, знаешь, такая, типа, вот. И я сейчас тоже буду звучать, типа, за Знайкой, но я вообще в Яндекс не собирался, ну, то есть у меня… Он слишком крутой или как? Не-не-не, слушай, тоже очень будет странно звучать, для меня его как будто бы не существовало, ну, типа, я жил в совершенно какой-то другой реальности, я ни с кем, у меня не было друзей из Яндекса, у меня не было никаких знакомых, и он как-то, типа, мне казалось, что какая-то корпорация большая, ну, типа… Ну, понятно, да. У меня был как раз, типа, не очень удачный опыт работы с большими компаниями, но был очень удачный опыт работы с маленькими командами, где мне было классно, и я как бы вообще не планировал, что я что-то такое там, короче, куда-то пойду, я не понимал, что я там буду делать, зачем и так далее. Вот. Но он мне уговорил встретиться, ну, не то что, ладно, уговорил встретиться. Предложил, а ты согласился. Он предложил, а я согласился, да, короче, мне было интересно. Вот, мы пообщались, и там был забавный дальше, там, переговорный процесс, мы долго очень общались, там ребята сначала как раз, ну, в общем, ну, это тоже хорошее, опять же, ребятам, кто ищет работу, возможно, конечно, не всегда так получится сделать, но если вы можете как-то рассказать преподавателю, о чем бы вы хотели, возможно, тоже неплохой вариант, потому что у меня получилось, что я отказал, и сказал, чуваки, на то, что вы мне предлагаете, я не согласен, но вот, смотрите, я прям подготовил ребятам Google Doc на странице 5.6, как я вижу, как это может работать. То есть я расписал команду, я расписал команду, которая была бы мне комфортна, кто бы мог быть у меня, кто должен быть еще параллельно от меня, то есть это тоже, типа, потрясающая история, потому что ребята согласились на структуру, ну, типа, не то, что я говорю, мне нужны люди, я говорю, я хочу вот здесь быть, а мне еще сбоку нужны будут другие ребята, которых вы там сами наймите, и они будут отдельно работать, которые будут заниматься другой частью. Вот, то есть я предложил им ту структуру, которая мне казалась оптимальна, для того, чтобы мне было интересно, им было интересно, и все работало. И мне хотелось как раз убрать больше операционной деятельности, мне хотелось узко специализироваться, заниматься дешбордами и визуализацией, а не там, потому что ребята предлагали сначала чуть шире, с доступами, с правами, со всеми историями. В итоге потом все равно пришлось заниматься, короче. Но я изначально сказал, что поначалу не хочу этого, вот. И это сработало, то есть на удивление, то есть возможно, если вам отказывают, или вам не нравится работа, может быть, как идея предложить какой-то свой вариант, как бы это могло сработать, потому что учитывая текущий голод на рынке, это может сработать. Вот, и поэтому получилось так, и это какая-то такая немножко… Я когда рассказываю ей всегда эту историю, она, конечно, такая слегка типа, ну, супер-кул-стория. Ну, киношная, киношная. Киношная, где был блог, тебе написали и так далее. И дальше, сейчас была ещё больше дичи там в этой истории, есть ещё больше дичи, короче, сейчас я тебе скажу. Но при этом это реально работает. Ну, то есть в формате, что зацепило Женю. То, что чуваку нравится, что он делает, чувак не готов соглашаться просто типа на деньги ими и так далее, а типа у чувака есть виденье и понимание, как это лучше делать. Ну, кажется, такое цепляет. То есть по факту, можно сказать, что это киношная история, а можно сказать, что просто, блин, я не очень нравился тем, чем я занимаюсь, и я понимал, как это делать. Вот, поэтому так сходится. Из забавных фликовых историй, у меня было в это время ещё офер от другой компании, короче, и я сидел дома на веранде, и у меня было терзание, что выбрать. Был вроде бы прикольный Яннекс, но который как бы тянул там, у меня были риски, что там будет много управленческой работы и так далее, и на небе появилась облачко в виде буквы «Я». Я вот сейчас, я понимаю, что я звучу как полнейший вообще кретин, я не сумасшедший, если что, я адекватен. Наверное. Короче, я такой типа, ну, поехали, попробуем. Очень хорошо получилось, я очень доволен, я очень благодарен Жене, он был очень крутым руководителем и, в общем, прям выстрелил, классно. Ну да, и вот такая история из серии… Муви, да, Муви немножко. Ну да, да, про киношно. А ты когда с Женей встречался, вы встречались в Яндексе, в офисе? Нет, он меня в кафе сводил. Ты чё? Куда? Боже мой, на Павелецкой внизу была… я забыл. Я понял, с виду на речку. Нет, которые на маленькой-то улочке, блин, я забыл, как кафешка называлась, но там есть до сих пор. Я понял, да. Просто в кафешке внизу розы, боже мой. Аврора, короче, вот. Да, мы с ним сходили поужинать. Я тоже чувствовал, знаешь, как это, типа, меня сводили на свидание, накормили, типа. Женя тебе, по-моему, тоже про это рассказывал, что у него такой стиль нанимать людей через завтраки. Ну, что-то такое, да, кажется, проскальзывало. А этот, я почему он спросил? Да тебя внутрь Яндакса, Женя, не водил. Нет, нет. Я просто вспоминаю историю про кафедры, а это могло бы сработать. Нет, нет, давай, давай, хорошо, нет, сработало. Сработало, знаешь, где? Нет, я потом ходил уже на собесы, ну, раунд собесов, и я потом ходил по этажу, и там были радиоуправляемые машинки, у людей стояли на полке. Кайф. И я такой, типа, вау, прикольно, большая контора, какие-то прикольные штуки. Ну, там у ребят висели какие-то дневные вывески, что-то, какие-то стикеры, плакаты, такая, типа, дичь, которая, я такой, о, прикольно. И я поэтому немножко потом, когда мы переехали из Авроры в Сити, там немножко вайп этот потерялся, и я расстроился здесь, честно. В этом смысле ты прав, да. Типа, да-да-да, тоже, наверное, сработало. Нет, ну и в целом, слушай, будет глупо, ну, тоже забавно, я шел с дропом зарплаты. Да, прикол. Ну, блин, типа, я был персонал-директором в стартапе, а я тут шел, ходил все-таки на позицию, да, хоть там некого синер-аналитика, наверное, и так далее, но как бы, ну, вот. Но это сыграло тоже все-таки, бренд, вот эта вот атмосфера. Да. У меня теперь сложно с людьми на выобщаться после Яндекса, типа, блин, это просто ужас какой-то, то есть, ну. Ты что, что не хватает вовлеченности, какой-то экспертизы или что? Нет, просто, ну, Яндекс все на ты, типа, да. А-а, про это. И я на вы, типа, я про это, очень тупо, я к тому, что… Это правда. Это очень подкупает такая культура, то есть, когда я пришел к ребятам, все такие там, о, привет, там, ты, все такое, я такой, типа, что так можно было, типа, что Ичар не занудствует, типа, просто с тобой общается по-человечески, ну, типа, кайф. Вот, поэтому, да. Я еще представил, знаешь, теме таких Ичарских практик, что в Яндексе у тебя, наверное, не спрашивали диплом о высшем образовании. Нет. Я переживал, когда они, они ко мне оформляют, я такой, а кандидатские приносите? Они такие, ну, приноси. Я такой, блин, блин, типа, ну, приноси. Ну, типа, чего обесцениваете вы кандидатские? Да-да, я понял. Обратная связь с Ичаром Яндекса. Если у человека есть кандидатская, скажите обязательно, приноси свою кандидатскую. Она очень нам нужна. Нет, ну, серьезно. Я понял. Ты поработал в ГО, сколько ты был в ГО? Три года. Три года я тут работал. Солидно. Классные задачи, мы очень много чего сделали, прям такой ground zero, подняли систему, мне кажется, очень круто получилось. Вели новую профессию в Яндекс, не было раньше биоаналитиков, были только аналитики данных, теперь появились биоаналитики. А вот, кстати, расскажи про биоаналитиков, чем отличается. Да, давай, это вообще жуткая путаница, ну, как всегда, на рынке, бла-бла-бла. Аналитики данных – это ребята, которые больше работают с питоном и с анализом гипотез, с построением гипотез и каким-то модстатом, может быть, в моменте анализа и принятия решений. Биоаналитики – это ребята, которые работают с данными и с визуализацией. Их задача больше закрывать операционную потребность бизнеса. То есть, если аналитик данных, он скорее копает, где мы можем, не знаю, вырасти, то биоаналитики делают так, чтобы бизнес, вообще говоря, работал, и работал вот сейчас эффективно, то есть, если ты увидел, что у тебя на графике упало на 30% поездок, тебе не надо быть суперсинер, умным, чтобы понять, пора что-то бежать делать. Поэтому там никакие не нужны модели. Поэтому разница в основном в этом. И да, то есть, биоаналитикой нравится такая смесь, надо все-таки моцтаз найти какую-то подготовку данных, и еще и дизайн, и понимать, как люди работают с информацией, да, понял. Ну, я так понимаю, что биоаналитик это человек, который отвечает бизнесу на вопросы, как дела прямо сейчас, что происходит. Да, в целом, да. Либо отвечает, что как плохо все было вчера. Потому что данные, ну, бывает реалтайм, на самом деле довольно редко в бизнесе встречается. Она рассказывает историю, моя мама работала на заводе в Северсталь, в Череповце, там работали какие-то большие станки, и надо было смотреть, что они все в пределах. Моя мама работала мониторингом. Живой алепт, да? Да, да, да, нормальная работа. Тоже маленький этот у нас был дешбор, он назывался Невский рак, потому что есть подстанции такие, которые используют либо раков, либо водные подстанции, либо как этих, моллюсков, чтобы проверять качество воды. Типа, если ему некомфортно, он начинает вести это, значит что-то с водой произошло не так. Поэтому тоже такие штуки. Тоже алертинг биологический. Прикол. Так, ты поработал в ГО 3 года, и перешел в Облако. Да, я перешел в Облако, случилось в феврале, и вендоры ушли из России, а Табло отказал от продвижения лицензии, и поэтому был проект к переезду из Табло в какую-то систему. Какая же эта система может быть? Слушай, это смешно, но мы выбирали. Я понимаю, что звучит смешно, что когда ты в Яндексе, выбрать что-то кроме DataLens, но изначально мы были типа rebels. Во всем Яндексе был DataLens, и такие Табло и маркет, такси и маркет сидят на Табло. И мы изначально были такие. Мы выбирали, куда переехать, выбрали DataLens, перевезли в него отчеты. Потрясающий проект, 600 отчетов, 3000 пользователей, вот это все, короче, это прям было весело. И, собственно, я сам перешел в команду, потому что захотелось уже сам продукт улучшать, про него тоже рассказывать. Я в него поверил, потому что он выдержал нас. У нас была сложная система в Табло, мы на самом деле перевезли на DataLens, и это прикольный показатель, что инструмент в целом довольно зрелый. Да, DataLens. Я просто его застал еще совсем ранним, но он, мне кажется, ничего толком не умел. Да, он сильно развился, то есть ему всего 3 года, по сути, и он скакнул сильно довольно, 3-4 года. Но потом, типа, не ты, твоя команда закрыла все, что нужно на DataLens, там проблемы. Да, да, нет, ну, естественно, он чуть менее гибкий в каких-то вещах, но есть положительные штуки, он работает быстрее. Он может сделать самый главный дэшборд в гоу нормально быстро работающим, так, чтобы это устраивало SEO. Поэтому есть свои плюсы. Понял. И правильно я понимаю, что мы подошли к сегодняшнему тю. Вот мы здесь. Да, да, я сейчас здесь.\n",
            "как попадать в IT, вообще менять профессию. Обычно я спрашиваю что-то, я говорю, представь, тебе пришел младший брат твоей жены, условно, и такой говорит, хочу войти. Что ты ему скажешь? Ой, слушай, я всегда говорю одно и то же. Я говорю, смотри, выбери какую-нибудь профессию. Сейчас есть всякие прикольные форматы, типа там IT примерочная, еще что-то там такого. IT примерочная? Да, я недавно видел ребят из Skype Pro, по-моему. Можно говорить у нас? Можно, конечно. Короче, есть сейчас довольно большой ресурс, где можно посмотреть, какие профессии существуют, и как-то сориентироваться, ну, хотя бы, куда у тебя плюс-минус лежит душа. Дальше я бы предложил попробовать взять вот эту профессию и найти какие-то книги, бесплатные курсы, и посмотреть, что там есть. Чуть-чуть вот так зарыбнуть, занырнуть, почитать, посмотреть, и попробовать это у себя применить. То есть даже если ты студент, даже если ты, не знаю, только куда-то вышел на работу или еще что-то, ты можешь делать аналитику. Любимый пример, если ты летишь в самолете, можешь делать аналитику, сколько раз люди ходили в туалет, отмечать, можешь смерить, сколько ты шагов ходишь, еще что угодно. А для тех, кто любит программировать, можно прямо на телефоне заколдить Computer Vision? Например, да. То есть как-то применить то, там, о котором тебе хочется попробовать в профессию, в своей текущей деятельности, точно можно. И это именно надо сделать. Потому что я очень предстегну ребят сразу покупать какие-то большие программы, курсы, и заниматься этим вот так обстоятельно, пока ты это не пощупаешь. Когда ты пощупал, ты можешь уже понимать, нравится тебе это или нет. Проблема в том, что многие хотят, ведь я это так вижу, может быть, не так на самом деле, многие хотят войти как раз из-за удаленки, из-за денег, из-за какой-то, опять же, секси классной и так далее. Кажется, что стоит заниматься тем, чем нравится. Вот, кстати, хорошо, что мы к этому подошли. Если приходит чувак и говорит, у меня двое детей, жена, ипотека. Хочу войти просто потому, что там 300к в секунду платит. Ну, для меня лично бы такое не сработало. Я думаю, что для человека тоже, скорее всего. Мне по жизни интерес важнее важного. И если неинтересно, ничего не получится. То есть у тебя не будут гореть глаза, не будет усваиваться информация, тебе будет все это грузом, а не желанием. Естественно, когда ты еще в каком-то возрасте, сложно что-то учить, нужна мотивация. Мотивация для меня, может быть, скорее такая. Может быть, есть ребята, для которых денег нет, мотивации, они из-за этого могут встать в 8 утра и подзубрить SQL, все задачки и так далее, тогда окей. Но я думаю, что таких все-таки в меньшинстве. Поэтому первое, что сделать, прощупать и попробовать у себя, понять, насколько вам интересно. Если у вас где-то загорелись глаза, вот тогда уже можно, не знаю, в что-то вписываться, пробовать куда-то устраиваться, покупать какие-то курсы, еще что-то и так далее. Но пока вы что-то не попробовали хоть чуть-чуть, и у вас не загорелись глаза, не стоит, на мой взгляд. Понял. Еще интересная штука, сейчас много ребят переходят, кто уже опыт какой-то другой профессии, и вот меня всегда очень убивает, что эти люди стесняются продавать свой предыдущий опыт. Часто люди такие, ну, я на джуна иду, ну да, я 20 лет работал финансовым директором, но сейчас я хочу быть дата-аналитиком, и это совсем другое. Ну, типа, камон. Нет, это близко реально. Финансовый директор близко к аналитику. Я часто именно вижу, когда люди даже, ну, окей, даже если это будет что-то неблизкое, типа ты там работал программистом, ну, программистом, наверное, вряд ли, переходишь в аналитиков, ну, не знаю, кем-то там менеджером по рекламе или еще что-то, ты всегда можешь притянуть свой предыдущий опыт к каким-то очень близким вещам. Если у вас есть какая-то область знаний, вы промышленностью занимались, на заводе работали, вы можете пойти аналитиком, но в область промышленную ваш опыт будет релевантен, вы будете понимать, что происходит, будете понимать бизнес-процессы. И поэтому в этом случае вы можете себя продать дороже. Поэтому если у вас уже есть релевантный опыт, не бойтесь его продавать. Я в целом при изменении своих профессий никогда не терял доходе. Ну, либо терял, типа, совсем чуть-чуть, и не совсем надолго. Просто из-за того, что я в наглую говорил, типа, я когда пришел работать в Кайцзан Институт, я говорю, я у меня опыт инженером, я дофига был на производствах, я все это знаю. Хотя, как бы, ну, а могу прийти и сказать, типа, ничего не знаю, ничего не понимаю. Типа, я с нуля, вот, джун-джун-джун, как бы. И поэтому... И когда я переходил в аналитику, я такой, камон, у меня, типа, три года... Я работал, во-первых, научным сотрудником, это то же самое, что аналитика, считайте. Я работал, короче, типа, бизнес-консультантом, это то же самое аналитика. Ну, это реально так, на самом деле, в части. Ну, типа, я сразу хочу уже все, как будто я тут аналитикой знаю. А я не знаю, при этом, Питона и Скуэль, короче. Типа, вот меня на технический совет позови, я провалю его. Вот, но, как бы, в большинстве случаев в реальной жизни медлу не нужны, ну, как бы, гораздо более ценнее софт-скиллы и предыдущий опыт общения с заказчиком, решение проблем и так далее, чем какие-то технические скиллы по знанию инструментов. Поэтому просто не бойтесь себя, блин, продавать подороже, и свой просто опыт старайтесь релевантно подать. Или идите, опять же, в ту индустрию, но с другой ролью, например. Это, мне кажется, хороший совет. Да, тут согласен с тобой. Я сам попал в аналитику в Яндексе, хорошо зная рекламу, попал в аналитику рекламы. Я был интернет-маркетологом, вообще-то. Я знал рекламу, но я не умел нормально программировать до Яндекса. Не то, чтобы я сейчас умею хорошо, но нормально умею. Так, понял тебя. Спасибо, что отдельно рассказал про тех, кто перекатывается. Согласен с тобой, действительно, это важно, и это можно преподать с выгодной стороны. Я просто прям чувствую эту боль. Сам, потому что менял, мне очень понятно боль ребят, тех, кто сейчас меняет профессию, и просто хочу их поддержать, чтобы они не расстраивались, и это реально сложно. Опять я хотел стать разработчиком, и стал разработчиком. Но ничего, потом все сложилось. Так, и давай последний блок, и мы даже тогда все успеем, мы даже ничего не выкинем из этого подкаста. Он на нас просто давит время. Короче, вас сейчас много ассистирует всякого разного рода алгоритмы ML, нейронки, большие языковые модели, генеративные сетки. Что ты думаешь конкретно о применительных профессиях, это мешает или помогает, и что думаешь глобально для человечества, для жизни? Ой, боже мой, все изменится, нас всех поменяют. Слушай, я думаю, что это будет новым инструментом, он будет автоматизировать рутинную работу. Я пробовал применять его сейчас для проектов, и TL'ку собирает прям неплохо. Да? Ну, мне нужно, ну, условно и TL'ку, мне нужно было спарсить JSON из API, вытянуть JSON, его сложить. Он мне написал питоновский код, я там поправил буквально пару вещей. И потом мне нужно было этот JSON разложить в плоские CSV-таблицы разного уровня для разных задач тоже. Типа, зашибись, мне очень классно помог. Вот. Короче, я вижу применение, я вижу, что точно какой-то рутинной такой работы наверное будет становиться со временем меньше. Не вижу какой-то прям вот такой мега-риска, что, ну, то есть давайте так, либо нас вообще всех нафиг заменят, и тогда пофиг, будет там аналитик, программист вообще. Все там будем, да. Типа будем, короче, да, не знаю, там, как в матрице лежать, условно. Либо это просто действительно автоматизируется часть рутины, и хайпа станет меньше. Ну, то есть, посмотрите, наша с вами профессия, ну, отрасль IT, она выходит на такой же материи, как когда-то выходила при промышленной революции работы за станками. То есть сначала надо было многому, и так далее, и тому подобное. Сейчас спецы также нужны, также это все нужно, но просто гораздо меньше количества людей. Да, сам рынок IT будет сужаться, давайте не будем себе в этом как бы, ну, ну, не сужаться, а расти такими темпами, как он рос раньше. Вот, и, ну, эта штука, конечно, в это тоже вложит явно какой-то большой вклад, но я не верю, что все само полетит и нас заменят. Вот, наверное, так. В работе применяю, что-то получается хорошо, что-то получается плохо. Где-то прям редик... ну, короче, прям беспардонно плохо. Ты такой, типа... Ты мне не можешь дать... То есть я его просил сгруппировать все элементы и потом дать связку с ключом, с предыдущим. Ну, типа, ты мне скажи, как ты сгруппировал, чтобы я это мог к данным подвязать. И он мне не смог этого сделать. Он какой-то булш не уводил. Ну, короче, в общем, ну, прикольно, интересно. Но не специалист. Но старается. Но старается. Еще и при этом культурный такой. Ой, прости, гогол выпал. Говорит, что у тебя здесь ошибка. Просто посыпает себе голову пеплом. Извини, пожалуйста, хозяин, я столько раз ошибся, сейчас все исправлю. И опять не работает. И он такой, черт, да ты просто джун. Окей, понял. Ну, я, как обычно, напоминаю, что подкаст выходит при поддержке школы Carp of Courses. Приходите учиться к нам, у нас классно. Мы понимаем IT, мы все из IT. Мы любим образование. Мы школу начали с того, что давайте учить так, как мы учим своих стажеров, чтобы они могли работать. И вот мы теперь учим широкую аудиторию так, чтобы они могли пойти и работать в IT. У нас есть много всяких разных курсов. Платные, бесплатные, машинное обучение, разработка, дата-визуализация. Есть демки. У нас теперь можно пообщаться с ассистентом, чат GPT, пока проходишь курс. Короче, у нас классно. Мы увлечены образованием, увлечены IT. Приходите к нам, вы точно для себя что-то найдете. У нас есть хороший телеграм-чат. Там постоянно люди что-то спрашивают друг у друга, сами учатся. В общем, хорошая атмосферная тусовка. Спасибо. Тогда на этом вообще все. Мы все успели. Всем большое спасибо. Было очень интересно. И любите визуализацию данных. Приходите в IT, не бойтесь. И если у вас такая судьба, стоит менять профессию, то делайте это тоже с любовью, чтобы вам нравилось. Да. Спасибо, что были с нами, слушатели. Спасибо, что послушали, зрители. Спасибо, что посмотрели. До встречи еще через одну неделю. И пока.\n"
        ]
    }
]