[
    {
        "url": [
            "https://www.youtube.com/watch?v=YpJ97aKsPj0"
        ],
        "title": [
            "Особенности трудоустройства в Австралии | Вебинар | karpov.courses"
        ],
        "description": [
            "Карьерный центр karpovꓸcourses: https://bit.ly/3NP6qA1 \n\nКакие существуют способы переезда в Австралию? На что в первую очередь смотрят местные работодатели? Сколько в среднем зарабатывают специалисты в сфере Data Science? \n\nВ карьерном центре karpovꓸcourses прошёл вебинар, где карьерный консультант и IT-рекрутер Нина Ятманова рассказала об особенностях рынка труда в Австралии (а мы сохранили для вас запись!). Кстати, профессии в области Data Science там находятся в листе востребованных — советуем присмотреться! \n\nLinkedin Нины: https://www.linkedin.com/in/ninayatmanova\nСписок востребованных профессий: https://immi.homeaffairs.gov.au/visas/working-in-australia/skill-occupation-list  \nСертифицированные миграционные агенты: https://www.mara.gov.au/ \nКалькулятор налогов: https://www.ato.gov.au/rates/individual-income-tax-rates/ \nПолная информация по иммиграции: https://immi.homeaffairs.gov.au/\n\n0:00 Вступление и знакомство с Ниной\n1:21 Способы переезда в Австралию: виды виз\n10:05 Полезные ресурсы для переезда \n12:38 Поиск работы в Австралии: помощь с визой и релокационный пакет\n15:50 Каналы поиска работы\n17:41 Чем хороши рекрутинговые агентства?\n20:53 Неочевидные каналы поиска работы\n21:34 В каком состоянии находится рынок труда в Австралии? \n26:00 Идеальное резюме \n33:50 Как проходит интервью?\n23:48 Особенности технического интервью \n40:42 Обратная связь после собеседования \n42:00 Самопрезентация: elevator pitch \n43:38 Совет для русскоязычных соискателей\n46:00 Виды работ в Австралии: постоянная, контрактная, частичная занятость, ИП\n47:25 Пенсионные выплаты\n48:05 Casual jobs, ABN\n48:50 Принято ли торговаться за оффер?\n50:58 Job hopping\n53:42 С какими трудностями чаще всего сталкивается российский соискатель?\n56:03 Удалённая работа в Австралии\n57:36 Core hours\n58:18 Необходимый уровень английского\n59:05 Отношения с коллективом\n59:34 Work-life balance\n1:00:42 Чего делать не нужно?\n1:01:39 Как стать своим?\n1:02:07 Средние зарплаты разработчиков и DS-специалистов\n1:03:40 Насколько важно образование?\n1:04:18 Налоги\n1:05:01 Стоимость жизни\n1:05:30 Где искать жильё?\n1:05:43 Контакты Нины\n1:06:13 Нужно ли сопроводительное письмо? \n1:08:56 Cultural interview \n1:10:28 Заключение"
        ],
        "audio_path": [
            "../data/audio/YpJ97aKsPj0.mp4"
        ],
        "text": [
            "Всем привет и всем доброе утро. Сегодня у нас очень интересная тема, поиск работы в Австралии. Не самая очевидная и не самая первая страна, которая приходит на УПА при поиске зарубежной работы. И сегодня про особенности австралийского рынка, про визы, про удаленку и другие интересующие нас вопросы будет рассказывать наш прекрасный гость Нина Ятманова. С вами, как всегда, Белла, карьерный консультант в карьерном центре Karpov Courses. Нина, спасибо тебе огромное за то, что пришла к нам пообщаться в субботу. Расскажи, пожалуйста, нашим слушателям вообще то, что нам нужно о тебе знать. Хорошо, ну что обо мне нужно знать. Пожалуй, то, что я 12 лет живу в Австралии, работаю в рекрутинге, в том числе в айтишном и занимаюсь карьерным консультированием, работаю на курсе Анны Знаменской и самостоятельно работаю, да, как независимый консультант. В том числе у меня вечерский бэкграунд, я достаточно долго в Москве работала, в автомобильном рынке. Вот, ну и сейчас получается, что у меня так или иначе деятельность связана с айти, поэтому, надеюсь, буду полезна. Приступаем? Я думаю, еще как. Да, давай приступим, начнем с самого первого вопроса. Не, я думаю, что уже кто захочет, уже к нам подключите, либо посмотрите уже в записи, да, вебинар у нас будет в записи. Да, начнем с самого первого вопроса. Самый первый вопрос, как вообще попасть в Австралию, насколько это легко, какие вообще есть способы переезда? Хорошо, давай тогда я, если ты не против, мне нужно важную оговорку сделать, да? Да-да, конечно. Нужно понимать, что я сейчас расскажу про способы переезда, про визу, про визы, которые есть, но я очень хочу, чтобы вы понимали, что визовые рекомендации может давать только зарегистрированный миграционный агент. Это вот очень важно, да? То есть ту информацию, которая есть, эта информация, которую я сейчас дам, она есть в открытом доступе. Эта информация как бы доступна всем, и она является общей. Чтобы вам получить информацию конкретно по вашему кейсу, что у вас происходит, что вам нужно делать, каким образом вам нужно документы собирать и так далее, вы должны это делать либо сами через сайт, который я дам, покажу сейчас, позже, либо вы должны обратиться к зарегистрированным миграционным агентам. Это важно, да? Вот, поэтому давайте, да, немножко поговорим про австралийский рынок и вообще, надо ли туда людям попадать, да? Да, давай узнаем. Давайте так, визы разные, естественно, как в любой стране в Австралии есть туристические визы. Я здесь выделила только те, которые являются самыми основными и показала, чтобы было понятно, что есть визы, на которых нет права на работу, да? Естественно, туристическая виза не дает права на работу, она достаточно короткая, и лучше даже не пробовать работать на этой визе, но можно начать искать работу на этой визе, да? То есть, что люди делают, они приезжают, начинают искать работу. Есть виза студенческая, которая дает право на работу 40 часов, 48 часов в две недели, она имеет свои преимущества, например, семья может выезжать, пара, например, выезжает, да, один из супругов идет на студенческую визу, там, учить английский, а второй, при этом у него будет 48 часов на право на работу, а у второго будет полные права на работу, то есть здесь тоже нужно понимать. Иногда, например, ко мне приходят на консультацию ребята, там, технари, которые хотят начать работать и спрашивают, как это сделать вообще, да, то есть всегда можно там супруге, например, взять студенческую визу и приехать, если, ну, то есть это достаточно быстро, да, но, естественно, ограничивает ваше пребывание в стране. Рабочая виза дает полные рабочие права, но ограниченное время пребывания, визы бывают до 4 лет, их можно продлевать, не по всем специальностям, но можно продлевать. И рабочая виза хороша тем, что большинство из этих виз дает возможность перейти на визу постоянного резидента. Виза постоянного резидента самая прекрасная. Австралия отличается тем, что в ней можно получить визу постоянного резидента сразу же, то есть находясь в другой стране, можно не отпадаться при определенных условиях. Допустим, в таких странах, как Штаты или Великобритания, таких виз нет, да, то есть такие визы, то есть это называется независимая эмиграция, и такие вещи можно сделать в Австралии и можно сделать в Канаде, да, вот такие вот есть независимые эмиграционные программы. Визу постоянного резидента, они тоже есть куча больших, большое количество разновидностей этих виз. Можно получить визу с правом пребывания на любой точке страны, можно получить визу с правом работы в определенном штате, можно получить региональные визы, они бывают постоянного резидента, бывают и непостоянного резидента. То есть, они, как бы, разные, хочу обсуждать не тем, что не отличаются от гражданства, только тем, что вы не можете голосовать и служить в армии. Как правило, никого это не огорчает, да, и это прямой путь к получению гражданства. В стране нужно будет прожить четыре года, и чтобы один из этих, один из этих лет, я уже вот по-русски начала забывать, как говорить, должна быть на визу постоянного резидента, и можно подаваться на гражданство. Ну, естественно, есть партнерская виза, понятно, она, наверное, не самая очевидная, то есть, некоторые люди могут тоже рассматривать, но она дает полные рабочие права, если вдруг кто-то решил, там, не знаю, связать себя узами с браком, с гражданином или гражданкой Австралии, здесь нужно только понимать, что не всегда это должен быть прям брак, это иногда просто могут быть отношения с регистрированием. Ну, и есть другие визы, виды виз, которые могут быть интересны, например, виза глобального таланта, она есть в очень большом количестве стран, включая Австралию, и здесь важно показать, что у вас есть какие-то достижения, которые отличаются от достижений среднестатистического аппликанта, да, то есть для этого не нужно получать Нобелевскую премию, но нужно быть человеком, который известен, например, в своем каком-то сообществе, выступает на конференциях, может быть, написаны книги-статьи, может быть, он является, не знаю, членом жюри какого-то конкурса, да, или проводит все время хакатоны или какие-то вот такие вещи, то есть при определенных условиях можно податься на визу глобального таланта. Есть виза постградуэйт, которая позволяет работать и находиться в стране там до шести лет в зависимости от того, какое образование получаете, но здесь, очевидно, надо образование получать в Австралии. Но это, наверное, вот такое. Можно уточняющий вопрос? Ты сказала, что удобнее всего искать работу в Австралии, уже находясь там, то есть правильно я понимаю, например, один из таких удобных способов переезда, это, например, получить образование или подаваться на образование в Австралии и в это время начинать искать работу? Образовательный поток, скажем так, образовательный, называется образовательный способ эмиграции, у него есть плюсы и минусы. Минус основной – это просто дорого, да, то есть, если вы едете учить, допустим, английский язык, то у вас там только обучение само будет, стоит примерно 10 тысяч австралийских долларов за год обучения, его нужно оплатить вперед, да, ну, то есть такая достаточно весомая сумма. Если люди идут учиться, допустим, в университеты, то там не надо оплачивать все обучение вперед, но нужно оплатить первые три месяца, которые тоже, наверное, 10 тысяч получится, да, вот, и потом нужно это все время оплачивать, то есть это просто дорого. Плюсы студенческого обучения, с моей точки зрения, заключаются в том, что, во-первых, вы будете уже жить в стране, будете учиться на языке, на котором вы будете работать, и вы будете получать образование, которое здесь и котируется, да, то есть люди понимают, что это за образование, что это за вузы и так далее. Особенно это важно, сбегая чуть-чуть вперед для дата сайентистов. Вот я, работая в IT-рекрутменте, обратила такое внимание, что чем больше человек вглубляется в работу именно как инженер, именно как человек уже близкий к науке, к технологиям, к архитектуре и так далее, то есть не хочу обижать там программистов, но я имею в виду, что там те, которые уже изучают достаточно глубоко вот эти технологии, то наличие образования становится очень весомым плюсом, да. И конечно... Литература, PhD, да, ты имеешь в виду? Да, ну да, ну PhD, наверное, это совсем роскошно, да, но, по крайней мере, местное образование там, если это будет data science, будет шикарно. Это не всегда обязательно, я потом про это расскажу, но это усиливает ситуацию. Ну и потом студенческая виза позволяет, если вы учитесь, получаете bachelor's degree или master's degree, позволяет, конечно, жить несколько лет в стране, получить post-graduate визу после этого и с большой долей вероятности остаться в стране. Просто это такой не очень быстрый путь, скажем так, для датариантистов и дата-аналитиков, поскольку вы, ну, на этом фокус делается в вашей школе, гораздо я рекомендую очень многим рассматривать визу постоянного резидента, особенно тем, кто уже имеет этот опыт работы, потому что для этого, для этой визы нужно как минимум три года опыта работы, там не все так просто, но это профессионально сходится в списке востребованных, и прям приезжайте все хорошие дата-сайтисты сюда. Отлично. Супер. Давай тогда, наверное, двигаться дальше уже к следующей теме. Так, ну что же происходит. Ну, я вот эти ссылки специально сюда вынесла, потому что они очень полезные, я оставлю их потом, ими можно воспользоваться. То есть первое, да, вся информация по иммиграции, туда пойдете, про все визы, все написано, как подавать, сколько делать. Куча людей делают визы в Австралии самостоятельно. Значит, здесь смотрите, если ваш кейс простой, то есть, грубо говоря, вы одинокий мужчина или женщина, там, не знаю, 28 лет с опытом работы в дата-сайенс, с образованием в дата-сайенс и с шикарным английским, то можно сделать самостоятельно переезд. Почему я сказала одинокий, потому что у нас за это еще дополнительный бал дают, то есть здесь существует вот эта бальная система, а когда мы говорим про независимую иммиграцию, нужно набрать определенное количество баллов, чем больше ты их наберешь, тем больше твоих шансов на то, что тебя пригласят поучаствовать в, уже как бы, в самом иммиграционном процессе. Вот, но если ваша ситуация не очень простая, например, вы никогда не учились по специальности, но работаете дата-сайентистом, там, 10 лет уже, или вы работали, допустим, по другим специальностям, сейчас переходите в дата-сайенс, здесь очень важно, ну, наверное, хотя бы взять консультацию иммиграционных агентов, серьезно рекомендую, потому что очень много там есть нюансов. Лист востребованных профессий находится на той же, на том же сайте, смотрите внимательно, сверяйте, практически каждое 1 июля и 1 ноября обновляется этот лист, в среднем, в среднем, вот в эти даты это происходит, и, ну, по-моему, айтишникам ничего не грозит, то есть вряд ли они из этого листа уйдут. Значит, если вы будете переезжать, даю про поиск недвижимости, про оформление льгот, если они, это к вам имеет отношение, оформление льгот, сразу скажу, имеет отношение только к тем, кто поедет по независимой визе, да, по визе постоянного резидента. Информация про школы, даю ссылку на сертифицированность иммиграционных агентов на любом языке, можно найти там людей, они должны быть зарегистрированы, если там они не зарегистрированы, вы с ними не работаете. Вы можете с ними работать, но не платить им денег, ну и, соответственно, сертифицированные переводчики все документы должны переводиться здесь, через людей, которые имеют эту сертификацию. Давайте поговорим, наверное, про то, как искать работу. Работу можно искать, скажу, из границы, можно искать здесь, вот когда мы говорили там в начале, надо ли обязательно приехать в Австралию, чтобы найти работу, нет, не надо обязательно этого делать, потому что это на самом деле зависит, ну, я бы сказала, что здесь нет прямо вот прямой корреляции, то есть если профайл очень сильный, если человек успел поработать в международных компаниях, если у него очень там такой хороший профайл, то он может подаваться из-за границы, его могут спонсировать на рабочую визу, спонсорство на рабочую визу, чтобы было понятно, это работодатель должен подать заявку в миграционный департамент и сказать, я буду спонсором этого человека, клянусь, он мне нужен, не могу такого найти больше на территории Австралии и буду ему все оплачивать, привезу его сюда, буду его любить, пока он здесь будет работать, я буду ему платить зарплату, все будет хорошо. Можно тут тебя остановить на секундочку, а какой вообще самый обычный релокационный пакет в Австралии, что это включает помимо визы? Я бы сказала, что это на самом деле зависит от компании, вот серьезно, если релокироваться через Амазон, я знаю много людей, которые релокировались из Беларуси в частности через Амазон, то там оплатят все, оплатят визу, оплатят переезд, оплатят контейнеры, там всю семью перевезут и так далее, помогут снять на первое время квартиру и так далее. Если переезжать из каких-то компаний, которые не являются такими монстрами, но хотят перевезти, это все вопрос переговоров на самом деле. Вообще по закону визу должен оплатить работодатель, и если вам работодатель говорит, я тебе сейчас визу оплачу, но потом ты мне должен денег вернуть, это как бы красный флажок, здесь нужно, я не хочу сказать, что не надо этим пользоваться, просто нужно понимать, что этот работодатель потом не будет сильно беспокоиться, он нарушает законодательство в данной ситуации. Могут быть такие работодатели, у меня был один кандидат из Южной Африки, который был разработчиком с зарплатой, если бы он был здесь, он получал бы 150 тысяч австралийских долларов в год.\n",
            "Но ему предложили 120 заплатить за билет, заплатить за визу его и его семье. Он на это согласился. То есть там была компания, которая совсем себе вот такой роскошный не смогла позволить релокационный пакет. Поэтому, если честно, я бы на вашем месте рекомендовала этот вопрос задавать. А если нет, сколько он, что он в себя включает? И можно ли включить что-то? Если вы видите, что работодатель, допустим, предлагает вам явно заниженную зарплату, а это может произойти, когда будут перевозить из-за границы, очень часто будет происходить, то вы сразу, окей, это все классно, но давайте все-таки посмотрим, а сколько там, может быть, вы мне билеты хотя бы оплатите, или давайте вот это. То есть это все вопрос переговоров. Окей, супер. Да, мы можем, наверное, вернуться уже к самим каналам поиска. Поиск по работе, да. Ну, если честно, вот сколько я участвовала в обсуждениях и общалась со своими коллегами и так далее. LinkedIn, конечно, переди планеты всей. То есть, чтобы было понятно, LinkedIn считается самым прогрессивным, самым таким каналом, сейчас популярным в работе. Местные IT-рекрутеры и рекрутеры крупных технологических компаний используют LinkedIn Recruiter. Это достаточно дорогостоящее удовольствие, то есть там много денег стоит лицензия, да. Поэтому я думаю, что они не смогли бы продавать это, если бы это не было популярным. LinkedIn хорош, да. Но это не значит, что там публикуются абсолютно все позиции. Чтобы было понятно, ну, как бы, есть более популярные сайты-вакансии, есть менее, да. Если мы берем Seek, Indeed и Glassdoor, то это три сайта, на которых айтишников можно найти, наверное, в таких случаях. Если они релокируются, то есть им нужна виза. Если они джуниорс, если они туда 10 лет назад зарегистрировались и с тех пор не обновляли свой резюме никогда. То есть это самые популярные вот эти сайты именно для айти. Для айтишников, да. Они там есть, эти айтишники, да, и их там много, да. Но чем более человек его растет, тем больше он усбегает, в принципе, туда выкладывать свои личные данные просто потому, что рынок перегретый, звонят много и так далее. Стараются не делиться вот этой личной информацией. А в LinkedIn это хорошо, потому что тебе могут постучаться, написать, и ты просто можешь не ответить, если ты не хочешь. Поэтому в LinkedIn вот это сейчас очень активная жизнь. И я думаю, что это один из самых сильных каналов поиска. Я рекомендую в том числе использовать рекрутинговые агентства. Здесь в Австралии раньше, до COVID, я имею в виду, было такое мнение, что 90% вакансий закрываются через рекрутинговые агентства. И здесь компании любят к ним обращаться и любят платить туда деньги. Сейчас я вижу, что ситуация поменялась. Многие компании берут внутренних рекрутеров, но, например, вот мы сейчас тоже столкнулись с таким же кризисом, как Америка. До нас волна эта тоже докатилась, много было сокращений. И, конечно, внутренних рекрутеров посокращали первыми, технологические компании. Свои были нюансы, но я очень сильно рекомендую обращаться в рекрутинговые агентства, особенно которые специализируются на вашей специальности. То есть как минимум те агентства, которые себя позиционируют как IT-агентства. Почему с ними хорошо работать? Во-первых, у них рекрутеры, там есть плюсы и минусы. Рекрутеры будут вам интересоваться в случае, если вас легко продать. Если вас продать не очень легко, то они, скорее всего, про вас быстро забудут. То есть это тоже надо понимать. Но если у вас будут права на работу, и вы сюда приедете, начнете искать, и у вас написано дата аналиста или дата сайентиста, то у вас будут обожать рекрутер, каждый первый рекрутер в любом агентстве IT будет вас очень сильно любить и звонить. И у этого рекрутера с большой долей вероятности, если мы не берем кризисную ситуацию, в которой до сих пор мы все находимся, пока еще не выбрались, то у этих людей будет несколько позиций, и они могут всегда дать, если это хорошие рекрутеры, они всегда могут дать инсайт по рынку. Что происходит, где, какие компании хороши, какие компании сильные, используют хорошую дату, используют современные технологии. Какие компании уже отстали давно. Вот такую всю информацию, она у нас есть, так или иначе. Мы общаемся с клиентом, мы понимаем, что там происходит. Мы всегда можем подсказать, подсказать по зарплате и так далее. Другой вопрос, я, наверное, не стала бы рекомендовать прям все брать за чистую монету. Понятно, потому что вам будут пытаться продавать то, что у них есть, а не найти вам самый прекрасный вариант. Но, тем не менее, с хорошими... Да-да, извини, давай закончишь, я задам свой вопрос. Да-да, я просто имею в виду, что, тем не менее, рекрутинговое агентство – хороший источник. Сайты компании точно нужно использовать, потому что часто они не публикуют на джопбордах свои позиции, и туда можно и напрямую выходить. То есть, если знаете какие-то компании, которые в вашей области работают, и они интересны, нужно туда написать напрямую. И я рекомендую не только сайты компании, я рекомендую выйти на LinkedIn, набрать название компании, посмотреть людей, которые работают в этой компании, найти там рекрутеров или talent acquisition любого уровня. Обычные, сеньорные, head of talent acquisition и так далее. И прям писать «Привет, я такое-то переезжаю и ищу работу». То есть, это тоже может сработать. Ну и неочевидные каналы поиска – это конференции. Если возможность есть участвовать удаленно, например, в каких-то конференциях. Там те же самые хакатоны, те же самые какие-то публикации и так далее. Метапы, да, участие во внутренних сообществах. Здесь очень много есть, не знаю, типа девчонки в IT, там girls in IT. То есть, они делают свои тусовки. Есть там те, где тусуются отдельно люди по каким-то специальностям. То есть, это нужно найти, нужно посмотреть и попытаться в этом во всем каким-то образом поучаствовать, потому что какая-то узнаваемость всегда приносит свои плюсы. Слушай, а вот тут буквально сказала сейчас про то, что до сих пор мы находимся в кризисе. Это действительно так? Вот насколько этот кризис ощущается сейчас в Австралии? То есть, например, какую ты видишь, например, конверсию по резюме? Как вообще там люди испытывают сложности, несложности с поиском работы? Ты знаешь, здесь вопрос, не то чтобы он некорректный, это вопрос в зависимости от того, про кого мы говорим. То есть, если здесь находятся люди, которые уже здесь живут, у них есть право на работу и есть местный опыт, то у них одна конверсия. Если мы говорим про людей, которым нужно спонсорство работодателя, у них другая конверсия. Я считаю, что если конверсия 3-5% для дата-сайентиста – прекрасно. Сейчас она, скорее всего, 1% или даже меньше. То есть, вам нужно отправлять 100 резюме, чтобы получить один оффер. И это даже неплохо, честно. Почему? Потому что здесь нужно понимать еще один момент, который, кстати, я в презентации не указала, но важно сказать. В Австралии финансовый год начинается 1 июля и заканчивается 30 июня. Мы сейчас находимся в самом начале финансового года 2023-2024. Это что значит? Это значит, что июнь нанимали очень плохо. Не выходите на рынок в июне, потому что… То есть, вы можете это сделать, но не огорчайтесь, если ваша конверсия будет 0,05. Потому что рынок сидит тихо и пытается бюджет дотянуть до такого, чтобы хотя бы цифры нормальные показать своим инвесторам. Поэтому стараются не тратить, а только-только зарабатывать. Я ожидаю сейчас, ну и не только я, и люди, которые работают на рынке, ожидаю сейчас умеренного всплеска в конце июля, начале августа, который должен продлиться до конца ноября. Почему я говорю умеренного? Потому что мнения разделяются. Кто-то говорит о том, что рекрутмент возвращается, все будет нормально, компании будут нанимать. Кто-то говорит, кризис еще не закончился, и поэтому рано радоваться. Есть рекрутеры, которые работают в Долине в Америке, они говорят о том, что если вы не начали нанимать сейчас, вы проиграли. В Австралии это тоже придет, только немножко с опозданием. Если в Америке начали с января прошлого года всех увольнять, у нас пошла волна с сентября. С января прошлого года увольняли очень активно до конца апреля, потом уже на снижение все это пошло, но все равно сейчас многие компании испытывают определенные сложности, вакансии не вернулись в рекрутинговые агентства до конца. Поэтому здесь нужно вот эти вещи понимать. Отвечая на твой вопрос по поводу конверсии, очень сильно зависит от того, какой есть профайл. Если человек едет с российским гражданством, при этом поработав в Гугле в Польше, понятно, у него все будет прекрасно. Буквально на этой неделе была девушка, которая работала в Гугле и работала в нескольких российских компаниях, там в Яндексе и так далее и тому подобное. Она здесь получила офер за три месяца. Получила офер очень хороший на продакт-менеджера. Я считаю, что для нее это был прекрасный результат, потому что она приехала сюда с правами на работу. Кстати, если мы говорим про права на работу, если мы говорим про партнерскую визу, здесь еще тоже есть такой интересный момент и рабочая виза. Рабочую визу может получить супруг или супруга, то есть один из супругов. И второй человек в семье, он получает точно такие же права. То есть, чего нет в некоторых странах. Там, допустим, у тебя есть разрешение на работу, ты можешь работать, а жена твоя не может работать. Здесь так, допустим, жена получила рабочую визу, приехала, муж может в таких же правах получать и полностью 100%. Поэтому, например, если ваша жена медсестра, прекрасно говорящая на английском языке, то пусть она получит визу, и у нее все будет гораздо быстрее и проще. Она очень быстро найдет работу, ее сюда перевезут. А вы приезжайте на такой же рабочей визе, и также вместе с ней потом мы прекрасным образом... Здорово, круто. Ну что, можем задвигаться? Да, вполне ответила, прям очень полно и четко. Ты абсолютно права. Нужно здесь разграничивать именно о ком мы говорим. Я думаю, что мы можем двигаться к резюме. Мы уже установили то, что конверсия хотя бы 3-5%. Шикарная конверсия. Посмотрим вообще, что должно быть в этом резюме. Резюме с большим удовольствием тоже зашарю. Потом она была... Тут темплейт, который я сделала для разработчиков. Он не будет ничем отличаться. Особо, кроме того, что у разработчиков очень много по технологическому стэку посвящено большая часть. Но дата-сантисты и дата-аналитики тоже все-таки с технологическим стэком работают. Поэтому смотрите, резюме очень похоже на то, что ожидают в Америке. Очень похоже на то, что ожидают в Британии. Поэтому все эти стандарты, их можно использовать. Начнем с того, чего делать не нужно. Не надо размещать фотографию вообще. Потому что это считается поводом для дискриминации, и поэтому здесь не приветствуют, и никогда в жизни вас никто не попросит прислать фотографию или резюме с фотографией. Не нужно оказывать полный адрес, вероисповедание, страну рождения, семейное положение. Ничего, что не относится к профессиональным вещам, вообще никого не волнует и не должно волновать. Если спрашивают, то можно на них даже наехать и сказать. Ничего, что вы, в общем-то, не совсем... Too much тема и слишком много информации. Да. Значит, что нужно указывать? Я очень много работаю с резюме или с людьми, которые сюда и переезжают, и, в принципе, ищут работу, и просто ищут развитие карьеры своей. Мы, как карьерный консультант, не пишут название должности. Казалось бы, очевидный момент. Но нужно писать. Здесь есть такой принцип. Если вакансия называется Data Scientist, нужно написать Data Scientist. Если там написана вакансия, например, называется как-то специалист в дата, дата-архитектор, и вы понимаете, что вы можете это делать, вы называете себя именно дата-архитектором. То есть он должен этот матч был быть, потому что он помогает просто рекрутерам хотя бы сообразить, на какую позицию ты подаешься. Указывайте локацию. Тут вопрос. Если я нахожусь в Москве, какую локацию указывать? Если вы в LinkedIn напишите локацию Москва, ни один рекрутер из Sidney вас не найдет. Поэтому попробуйте выставить Sidney и посмотреть. Рекомендую еще посмотреть вебинары по LinkedIn, потому что LinkedIn тоже это все дело пресекает. Если вы будете часто менять локацию, вам могут заблокировать временно профайл. Поэтому там нечасто это можно делать. То ли это они блокируют принципы изменений часто, то есть, по-моему, раз в две недели или раз в месяц можно поменять только. Но вы, если будете уже тестировать эту тему, пишите ту локацию, на которую вы претендуете. Когда я говорю про наличие рабочих прав, если вы уже получили какую-то визу, которая позволяет вам работать, например, вы едете хвостиком со своим супругом или супругой, которая получила студенческую визу, и вы знаете, что у вас будут полные права. Кстати, лирическое отступление. Я не сказала, что если переезжает пара, в которой один из супругов получил студенческую визу, то вот это ограничение 48 часов только у студента, а у супруга нет этого ограничения. Супруг может на полную рабочую неделю спокойно выходить. Поэтому он должен написать, виза такая-то истекает, тогда-то полные рабочие права. Почему это нужно писать? Это сильно снизит вашу конверсию, сразу говорю, если вы подаетесь из-за границы. Но если вы потратите время свое и рекрутера на то, чтобы он тоже выяснил, что у вас нет прав на работу, ну, как бы, смысл, да? То есть я считаю, что лучше указать. Если вы хотите протестировать рынок и, в принципе, посмотреть, будут ли на вас откликаться, то вы эту информацию убираете, но ее надо будет проговаривать потом либо на первом скрининге, либо во время интервью. Очень важно описание компании.\n",
            "Нужно делать специальные кампании в одном предложении. Почему? Потому что, ну я знаю, конечно, одного, у меня был один босс, который знал, что такое Яндекс, да, и он говорил, Яндекс, это же круто в России, но на самом деле люди не знают. Кампании российские в основном не знают, и поэтому нужно написать, нужно давать аналог, да, то есть, допустим, аналог Google в России, да, или там вы пишете про, вы работали в мобильном операторе, вы пишете аналог, водофон в России, например, да, то есть какие-то вещи, которые людям помогут понять. Пишите индустрию, если компания большая, пишите размер компании и какие-то вот такие, если компания лидер рынка, напишите компания лидер рынка и так далее и тому подобное, да, вот какие-то такие моменты надо написать. Ну и самое важное. На твой взгляд про компании, как ты думаешь, вот многие компании сейчас российские находятся под санкциями, испытывают какие-то сложности, вообще это является стоп-фактором, на твой взгляд, особенно если даже госсектор. Да, Австралия поддерживает санкции, поэтому здесь нужно быть аккуратным, люди могут не сразу сообразить и могут даже подать на визу, но когда визу будут рассматривать, на это будут обращать внимание, поэтому если вы хотите точно, сто процентов вы хотите уехать, лучше поменять компанию сейчас в России и уйти из-под санкционных компаний. Еще раз повторяю, смотрите, это не какое-то вот там стопроцентное вот точно, все, я работаю в Сбербанке, крест на себе поставил, там никогда уже не смогу уехать, такого нет, ну просто вероятность того, что на это обратят внимание, она увеличивается, да. У нас была там ситуация, когда мы не могли нанять программиста, который работал в Крыме, просто потому что он сидел физически и кресло у него в Крыме стояло возле компьютера. То есть такие моменты нужно учитывать тоже, да. Достижение в цифрах очень важно. Я много рассказываю на консультациях про это и на курсе мы много говорим про это, но я сейчас не буду долго про это говорить, потому что это целая большая тема. Когда я говорю про достижение в цифрах, указывайте либо то, что вы, не знаю, проект, бюджет проекта, если это было важно, да, если вы можете сказать, какой это был примерный хотя бы бюджет. Укажите ваш импакт, то, как повлияла ваша работа на то, чтобы, да, то есть вы сделали что-то, это позволило сделать то-то, да. То есть схема такая, делал вот это, что привело вот к этому и измерялось вот таким-то образом. Поэтому проекты, особенно фичи, над которыми работали, у меня были клиенты, которые не хотели читать резюме, если там было написано общие слова, не было понятно, над какими он проектами работал и что он вообще в принципе делал, да. Поэтому лучше указать вот это, все это в буллет-поинтах, не надо много расписывать, должно быть 4-5 буллет-поинта для последнего места работы и там 3-4 для предыдущего. Резюме должно занимать 1-2 страницы, убираем весь нерелевантный опыт, в ресторане работали на начале карьеры, никого это не интересует, писать их не нужно. Обязательно резюме нужно либо пропустить через Grammarly, либо перепустить через ChatGPT, который тоже, кстати, неплохо справляется, ему можно просто сказать, проверь только грамматику, ничего не переписывай, да, то есть вот такие вещи, или отдать носителю языка для проверки. Это важно, потому что если будут там косяки опечатки для людей уровня все-таки технологического, на это будут обращать внимание. Если вы идете совсем в низкие позиции, то, наверное, нет, а так это важно. Какие-то вопросы есть сейчас по резюме? Я смотрю, что нет, пока что нет, у меня тоже нет, я думаю, можем двигаться дальше. Хорошо. Интервью. Значит, во-первых, как проходит процесс, да, это на самом деле зависит, подаетесь ли вы напрямую в компанию или вы работаете с рекрутером, да, то есть если вы работаете через рекрутинговое агентство, как правило, у вас будет скрининг по телефону или по видеоинтервью. Что такое скрининг? Это когда вам будут задавать те вопросы, которые все будут задавать из интервью в интервью, да, то есть к пятому у вас это уже будет от зубов отскакивать. То есть это будут вопросы, связанные с вашей локацией, с вашим правом на работу, с тем, что вы ищете, что вы хотите, что для вас важно, то есть вот такие вот моменты, они будут задаваться. Рекрутеру агентства это важно, потому что он должен понять вероятность того, что он вас может продать, и если он вас может продать, он вас будет питчить, он поможет вам поправить резюме, он поможет вам подготовиться к этому интервью, он расскажет, что будут ждать на интервью и так далее. То есть вот в этом смысле с агентами прикольно работать, потому что они реально помогут это все сделать, особенно если это хорошие рекрутеры. Если это компания, то, как правило, идет скрининг через рекрутера, внутреннего рекрутера или это называется Talent Acquisition Specialist, как правило, если это внутренний. Все по-разному к этому относятся. Сейчас в технологических компаниях, я имею в виду, когда мы говорим про компании, я все-таки буду акцент делать на технологических компаниях, они в большинстве своем все-таки убрали вот эти раздражающие моменты первого скрининга такого, очень поверхностного, когда им вообще все равно, что ты скажешь. Они все-таки с первого раза, особенно если они видят хорошее резюме технологическое, они запрыгивают сразу на видеоинтервью, пытаются как можно скорее пообщаться с кандидатом, потому что кандидатов очень большое количество предложений, они могут выбирать реально много. Сейчас конкуренция большая и разница с прошлым годом, я могу сказать, что в Австралии после COVID открылись границы и пошел наращивание вот этой вот скорости возвращения иммигрантов на территорию страны, поэтому я вижу большое количество приток людей, которые получили визу постоянного резидента, там рабочую визу или едут там прицепом со своей семьей. И очень много людей из Индии, естественно, очень много людей из Китая, очень много людей из Пакистана, там хорошая достаточно IT-школа, оттуда едут много, конкуренция будет тоже, но и спрос достаточно большой. Поэтому, как правило, это первое интервью, оно уже такое, чтобы точно понять, кто ты, что ты. Если вы адекватно общаетесь, у вас хороший английский, можете рассказать про свой опыт и понятно, что вы вообще соображаете в теме, вам назначат техническое интервью. Это может быть очень быстро, если у вас очень классный профайл, вас прям быстро-быстро будут брать в процесс. А что это, это домашка больше или лайфкодинг, что здесь больше? Техническое интервью, ну смотри, по поводу домашки, чем выше человек по своему опыту, тем меньше он хочет на домашку тратить времени, потому что это дорого, его время, и люди понимают, что будут те, кто будут нанимать без домашки. Большинство компаний техническое интервью может происходить в двух вариантах. То есть, если это джуниор или начало медла, могут прислать домашку, сказать, сделай технический тест, пришли, мы его посмотрим и по его результатам тебе что-то скажем. Это будет часто. Если это будет лидовая позиция или менеджерская позиция, почти маловероятно, что дадут домашку домой. Техническое интервью, это будет онлайн, как правило, интервью, которое может в себя включать лайфкодинг-сэшн или какую-то дискуссию. В некоторых ситуациях вот этот лайфкодинг или какое-то взаимодействие онлайн с командой, именно техническое, оно может присутствовать. Некоторые к этому отказываются, потому что стресс у кандидатов достаточно большой. У меня был клиент, который говорил, выбирай, либо хочешь лайфкодинг, либо мы тебе домашку дадим. Люди выбирали, кому-то было удобнее так, кому-то было удобнее так. Кто-то говорил, я вообще весь код забываю, сразу все забываю, когда на меня все смотрят. Техническое интервью, много будет вопросов технических, некоторые компании углубляются в суть предмета, пытаются не то что спрашивать теорию, но все-таки спрашивать какое-то мнение человека. Допустим, они могут спросить, расскажи, приходилось ли тебе строить архитектуру того-то? И если тебе приходилось, а что была за ситуация? И здесь очень важно, я пишу, вспомните несколько реальных кейсов из практики, чуть пониже. Используйте смарт. Допустим, такие компании, как Амазон, тот же самый, и куча технологических компаний хотят слышать ответ в стиле смарт. Сейчас не объясняю, что это такое, погуглите, это очень легко. Но для этого нужно эти реальные кейсы вспомнить. Кейсы, о которых спрашивают, это расскажи, там самые сложные проекты, расскажи проекты, где у тебя не получилось, где ты облажался, грубо говоря. И это всегда должен быть, у меня не получилось, но теперь я делаю по-другому, то есть lesson learned, я делаю теперь по-другому. Вот, спрашивают, чем ты очень сильно гордишься, расскажи. Это все должно быть в формате смарт, достаточно быстро, логично разложено. Старайтесь, смарт вообще позволяет что делать? Коротко отвечать на вопросы, не растягивая, не вводя людей уже в такое состояние транса, там куча деталей. Да, четко, ясно. И техническое интервью, cultural interview нужно отвечать именно в формате смарт, это будет идеальный формат. И к техническому интервью нужно обязательно готовиться. Для этого, чем громче компания, тем больше информации онлайн, нужно выходить, смотреть, как собеседуют в Аксенче, как собеседует там тот же самый Амазон, как собеседуют в Кангу. То есть вот эти все вещи нужно просто поискать, посмотреть, разобраться в этих задачах, могут давать онлайн задачи и их нужно будет решать. Некоторые компании делают one day offer, то есть это когда ты утром приходишь и там на 5 часов, или онлайн подключаешься на 5 часов и у тебя там несколько интервью один за другим идут. Вот, и цель этого сделать оффер быстро, то есть чтобы человек не успел отомниться и мы сделали оффер, уже все, нужно выезжать. Нин, а вот как ты думаешь, как лучше в таком случае вообще, принято ли просить фидбэк, дадут ли тебе реально честный фидбэк в интервью, почему ты не прошел? Ну, это зависит от людей, потому что я видела на своей практике, никого я не удивлю этим ответом, честно, людей, которые не хотели говорить, что было не так, или они говорили, я тебе скажу, но ты ему не рассказывай. И были люди, которые профессионально работают, они давали очень подробный фидбэк. Они рассказывали, по каким параметрам тестировали человека, они писали, например, problem solving такой-то, communication skills такой-то, teamwork такая-то, и они давали эту связь. То есть попросить всегда можно, дадут, чаще дадут по техническим вопросам, мне кажется, по техническим в принципе дают. Поэтому очень много говорят про фидбэк здесь, рекрутеры все это обсуждают, считается дурным тоном не давать фидбэк, но я также знаю, что люди стараются очень осторожно давать фидбэк на случай, если будет потом разборка какая-то, компания будет обвиняться в дискриминации и так далее. Люди могут от него избегать. Когда я говорю по поводу подготовки к самопрезентации, это классика elevator speech. Тоже погуглите, если не знаете, что это такое. Там 30 секунд, 1 минута, очень быстро, самые основные вещи с акцентом на то, что интересно компании. Как узнать, что интересна компания, нужно открыть вакансию и очень внимательно ее почитать, потому что некоторые вакансии очень формальные, а некоторые четко рассказывают, нам нужно вот это, мы ставим акцент на этом, мы ищем того-то. И тогда нужно рассказать, я вот это делал и это вот это, и чтобы этот был матч, и человеку было интересно потом говорить. Если работали в крупных компаниях с большими именами, обязательно включить в эту самопрезентацию. Самопрезентация – это не про историю, родился, вырос и так далее, это про то, кто я сейчас. То есть мы не говорим о том, что я приехал из России, там я закончил школу, а мы говорим о том, что я дата-синтист, более чем с 5 годами опыта работы, работала над такими-то проектами у меня там в таких-то индустриях, да, и сейчас моя зона интереса там-то, там-то. И желательно, чтобы это совпало с вакансией. Здесь нужно как бы аккуратно, но все-таки, как в конце я пишу, отвечайте только на заданный вопрос. То есть понятно, что когда вас собеседуют, будут искать матч, да, поэтому там не нужно говорить, вот вы классные, но вы для меня будете как взлетной полосой на то, чтобы потом попасть в Google. То есть не надо им это рассказывать, да, просто ставьте это для себя. Моменты, которые очень, я считаю, для русскоязычных людей важны, это улыбаться и научиться смолтоку. Это прямо критично, очень у нас люди, конечно, к этому не привыкли, да, поэтому пусть эта улыбка будет в рамках там какого-то, не знаю, это может быть смешной случай какой-то, который вы можете рассказать, или просто там, просто постарайтесь выглядеть позитивно. Не просто можно не улыбаться бесконечно, но позитивно выглядеть. И смолток – это обязательно начало встречи. То есть когда подключится человек на онлайн, он все время скажет «Hey, how are you?» И вам нужно сказать типа «Okay, I'm good, how are you?» И пытаться поддержать вот этот момент, потому что человек может сказать «О, этот день сегодня просто, я не знаю, этот дождь меня смузит с ума». И вы можете сказать «Вот это удивительная вещь, да, а у меня как раз солнце, и я вот скучаю по дождю». Ну то есть какие-то вообще вот такие вот вещички, их тоже очень сложно русскоязычным людям, как бы смысл типа зачем про это говорить. Но это очень такой важный icebreaker, который, если вы умеете использовать, потому что у вас может быть еще такая ситуация, там три человека на интервью, подключились два, включая вас, третьего ждем и сидим. В эфире. И желательно как бы за это время ну что-то сказать.\n",
            "Стив, здорово, вообще спасибо большое, что ты смог подключиться, да, там, ты один сейчас в офисе, у вас вообще какая ситуация, расскажи, ну и там вот, вот это вот, вот такое вот, такая беседа, она очень важна будет, обязательно переспрашивайте, если непонятный вопрос, я вообще считаю, что естественное поведение лучше всего работает, да, забыли слово на английском, скажите, ой, что-то забыла это слово на английском, дайте по-другому начну, да, или там, я ответила на ваш вопрос, чувствуете, что вот уже даете много информации, люди там головой качают, но не перебивают, то есть я ответила на ваш вопрос, да, или там можно сказать о том, что я немножко волнуюсь, поэтому могу путать времена глаголов и посмеяться на эту тему, да, то есть это тоже расслабит атмосферу и будет понятно, что это окей, едем дальше, я думаю, да, ты там такую подробную вообще ликбез составил про интервью, да, про оффер уже, хорошо, оффер, а с Смотрите, есть несколько типов работ в Австралии, это постоянная, контрактная, частичная занятость, есть индивидуальный предприниматель, да, и очень важно, чтобы вот здесь, когда вы будете обсуждать работу, вы должны понять, что это будет за работа, то есть постоянная работа, это наша там классика, да, устроились на работу, нет даты окончания, работаем постоянно, есть отпуск, оплачиваем мы там больничный и так далее, и тому подобное, на постоянной работе, заплата указывается в годовом размере, да, то есть тысяч долларов в год до вычета налогов, контрактная работа, это работа, которую очень любят айтишники, включая любых дата специалистов, любых, почему, потому что в контрактной работе люди очень часто получают на 20-25% больше, то есть это прям большой очень плюс и есть люди, которые работают только на контрактах, как правило, это сеньорные специалисты, найти джуниору контракт возможно, но он не принесет такого, таких золотых гор, скажем так, да, если это будет человек сеньорном уровне, а у него будет совсем прекрасно все с работой и это будет дневной доход, да, я потом дальше покажу эти цифры, вот, пенсионные выплаты superannuation, это как наш, у нас пенсионный налог, да, то есть это выплата, которая будет накапливаться на определенном счету в компании, которая потом будет вам платить пенсию, здесь такой интересный момент, если вы приедете в Австралию на рабочую визу и проработаете здесь 5 лет и за 5 лет заработаете себе вот этот superannuation, не получив, да, визу постоянного резидента и захотите вернуться или уехать из Австралии куда-то, вы просто подаете claim и забираете эти деньги с собой, то есть они здесь не остаются, но если вы получили постоянного резидента, такого варианта уже нет, значит и casual работа, она как правило неприменима к нашим айтишникам, casual работа- это как правило, там не знаю в ритуале люди могут работать, сестры могут работать, какие-то вот такие профессии, которые casual очень редко бывают, для студентов это может быть, я не думаю, что это может для специалистов быть распространенным вариантом, ну и на IBM, как я сказала, индивидуальный предприниматель, это уже люди на контрактах, они могут работать именно как индивидуальный предприниматель, это все только о налогах, то есть вот только про это, то есть вам, наверное, все это неважно. Нет, слушай, а если мы говорим про офер, то вообще торговаться за офер принято как-то в Австралии, вообще как это лучше делать? Ну, мы попозже поговорим про это, да, будет вопрос, если ты не против, вот, ну и да, визовое сопровождение, мы уже говорили, я не буду повторять, да, это нужно будет потом обсуждать, вот здесь как раз, видишь, отлично, да, поспешила, да, давай отвечу на этот вопрос по поводу торговли за офер, это как везде, вот серьезно, в России торгуется, здесь тоже торгуется, разница вот в чем, есть компании, которые не будут торговаться, потому что это очень формализованные компании, например, государственный сектор, у них есть грейды и у них вот так, вот так и так, но в государственный сектор вас не возьмут без гражданства, можно расслабиться, но есть, например, банковский сектор, в Австралии есть местный Тинькофф, грубо говоря, да, и вот я знаю, что у них есть как бы вилка какая-то там в пределах там 30 тысяч, например, да, по ней можно будет торговаться, больше они могут дать, если только еще там вышестоящие руководители это подтвердят, здесь смотрите, какой принцип, если вы какой-то классный специалист, торговаться можно и нужно, потому что, скорее всего, это получится, да, если вы какой-то начинающий человек, то с меньшей долей вероятности будут как бы, ну, идти на какую-то торговлю, здесь еще есть один нюанс, если вы нанимаетесь через рекрутинговое агентство, от вашего имени будет торговаться рекрутер, поэтому обратите внимание, насколько этот рекрутер адекватен, посмотрите, насколько он вообще, в принципе, про это говорит, что он советует сделать, да, и тогда на этом можете как бы уже на это опираться, и здесь я рекомендую торговаться, но не манипулировать, потому что все-таки манипуляция может привести, ну, как бы нежелательным, скажем так, последствиям, да, поэтому лучше вот этого не делать. Испытательный срок 6 месяцев, пояснять тут не буду, там практически у всех он такой, джоб хоппинг, вы у меня задавали этот вопрос, опять же… Да, вообще, как к этому относятся, то, что там 2 месяца или больше там? Я, например, в агентстве, когда разговаривала со своим CEO, он мне сказал, мне вообще плевать, если человек часто меняет работу, да, мне важно, что он там делает. Здесь, смотрите, люди всегда будут задавать вопросы, почему это происходит, да, то есть если вы только приехали в Австралию и у вас первые 2 года была вот эта частая смена работы, то, скорее всего, это будет понятно, потому что, когда ты приезжаешь, даже если ты очень-очень классный, большая вероятность того, что ты попадешь куда-то, где тебе будут меньше платить, а потом предложат больше другие компании или еще что-то, то есть это нормально. Если вся практика жизненная такая, то это вызовет гораздо больше вопросов. Если человек проработал в одной компании 6 лет, потом в течение 2-х лет 3 раза сменил работу, ну, будет понятно, что он там, может, на рынок вышел, вообще не понимал, как искать работу и так далее после большого перерыва, скажем так, неактивного. Поэтому, ну, я рекомендую всегда помнить несколько правил. Сначала я работаю на резюме, потом резюме работает на меня, поэтому про это нужно помнить и понимать, что не надо просто гипотетически сидеть на какой-то отвратительной работе, когда вам предлагают еще кучу прекрасных, только для того, чтобы у вас не было там 7 месяцев, не надо полтора года сидеть и дотягивать, просто чтобы это выглядело в резюме. Поменяйте работу, но просто помните, что если вы сейчас переключаетесь на этой работе, там желательно как бы поработать, то сделайте осознанный выбор, чтобы поработать вы могли там подольше. И опять же, смотрите, как я сказала, контрактная работа там вообще будет всегда, потому что контракты бывают короткие, бывают 3 месяца, 6 месяцев, 12 месяцев контракт. Ну, то есть, если вы напишите, что это была контрактная работа, вас вообще никто не спросит, почему так часто. А к перерывам также относите, например, полгода перерыв или год перерыва опыта? Не надо на этом акцентировать внимание. Нужно просто про это рассказать. Если будет вопрос, да, я ездил там в ковид, не видел своих родных, вот уехал там на 7 месяцев. Это нормально, вообще никто не будет даже на эту тему переживать. Вот. Даже длинные перерывы можно объяснить. Чаще всего сталкиваются российские соискатели. Ну, вот я сказала, что, во-первых, российские соискатели сталкиваются с тем, что им тоже нужно, ну, как бы, если нужна виза, то у них будут вот эти проблемы, но они в этом смысле не будут отличаться ни от каких других соискателей, ни от индийских, ни от пакистанских, ни от китайских и так далее. То есть это и даже не от британских, потому что им тоже нужна виза рабочая. Вот. Поэтому это как бы ничего такого. Основное, если говорить вот именно про российский менталитет, есть несколько моментов. Вот этих связано с нашим покерфейсом, да. Про это нужно помнить. Там неумение поддерживать смолток. И вопрос вот часто очень обвиняют русскоязычной директивности. Директивность заключается именно в прямолинейности, я бы сказала. Они это называют to directive, но на самом деле это как бы прямолинейность определенная. То есть здесь нужно изучить английский повнимательнее, смотреть, что есть вещи, которые, ну, нельзя просто так говорить о том, типа, где мой отчет, да. То есть нужно где-то там сделать реверанс, подвести к этому аккуратно. И вот этот как бы soft management, это все-таки такая тема больше сейчас западной менеджерской культуры, нежели вот там директивный такой, я сказала, и все. Вот. У меня было, у моего друга была ситуация, когда обвиняли в буллинге, потому что он просто достаточно четко тын-тын-тын. Но четко, но, видимо, недостаточно вежливо с английской точки зрения это говорил. То есть это выглядело для людей как преследование, что типа, что ты меня там преследуешь с этим отчетом? Сколько можно вообще? В конце концов, вся жизнь впереди, сделаем еще этот отчет. Ну, то есть вот такие вот вещи, да, они могут присутствовать. И с английским очень важно здесь разобраться. При этом я могу сказать, что когда я работала с британцами, я не видела никого, кто более вообще директив, чем британцы. Серьезно. У меня иногда просто отвисала челюсть, насколько они вообще могут там так уже припечатать. Да, очень вот это, ну как бы. Поэтому нужно немножко в культуре разобраться, почитать на эту тему книжки, послушать советы и так далее. Про фидбэк мы поговорили. Возможно, удаленная работа присутствует вообще везде, естественно. Также, как и везде, в Австралии сейчас очень многие компании возвращают людей в офис на 2-3 дня. Для айтишников можно найти удаленную работу, и много, и там больше готовы договариваться на эту тему. Здесь есть в ней очень важный нюанс. Как правило, когда здесь пишут про удаленную работу, они имеют в виду в Австралии. Потому что есть также как и в других странах понятие налогового резидента. Ты должен жить в Австралии не менее 6 месяцев, чтобы быть налоговым резидентом. Ты 6 месяцев пожил, потом можешь еще где-то, но ты налоги продолжаешь платить в Австралии. Как только ты перестаешь быть налоговым резидентом, компания должна понять, как она эти налоги будет за тебя платить. Они могут пойти на то, что вы будете работать в Новой Зеландии, но для этого у них должно быть в Новой Зеландии свое юридическое лицо. Либо вы должны, смотрим наверх, в мою презентацию быть ABN, независимым предпринимателем, но тогда компании очень многие будут рассматривать только контракты и не будут брать на постоянную работу, потому что это уже взаимоотношение двух юридических лиц, а все-таки не сотрудник. Поэтому очень часто люди говорят, ну какая разница, я вот буду работать. Плюс внимание обращают на часовые пояса. Если вы будете говорить, я вообще по ночам просто люблю, вот просто вот только ночью люблю, вот живу, вообще день светлый видеть не хочу, все равно, скорее всего, вам не поверят, потому что в какой-то момент вы забудете куда-то подключиться на какой-нибудь митинг и так далее. Я вот здесь не указала, но скажу еще, что есть понятие core hours во многих компаниях. Например, если вы работаете удаленно, то вам говорят с 12 до 4 дня ты должен быть подключен, должен быть вот просто возле компьютера сидеть. Остальное время делай, что хочешь. В это время мы будем назначать митинги, мы будем назначать встречи, можем тебе позвонить и так далее. Вот это core hours. Или могут быть core days. Например, там в моем офисе сейчас вторник, все должны быть во вторник. Остальные дни, как хотите, любые удобные, но во вторник все должны быть в офисе. То есть вот такие вот моменты, ну они, я не знаю, в России, по-моему, наверное, тоже так же, да, примерно. Да, конечно, там часы звон или часы, когда нужно быть в офисе, конечно. Про английский я сказала, очень важно, даже если вы технари, важно общаться на английском языке. А вот интересно, какого уровня английский язык должен быть? То есть должен быть уровень native English? Нужно, чтобы вы могли понимать и чтобы, когда вы говорите, вас могли понимать. И чтобы вы могли говорить на технические ваши, вот именно вашу как бы тему, которая у вас есть. То есть если вы не можете обсудить библию, это окей. Да, но если вы не можете обсудить дата, какие-то вещи, то это не окей, это будет сложно, да. То есть очень такого начального уровня программисты могут работать и не начально, а удаленно, когда там можно все только писать, может аналитикам чуть попроще. Но людям, которые заработают с архитектурой, которые должны работать с большим количеством стейх-холдеров, это важно. Отношения с руководителем, с коллективом. Я уже сказала про софт-менеджмент, не буду тогда сильно как бы погружаться туда. В коллективе есть там определенные, как правило, традиции. То есть это могут быть вечерние дринки с людьми, когда они заканчивают пятницу чуть пораньше смены, идут в соседний бар чай колдыкнуть. То есть лучше с этим быть, не обязательно не со всеми пить, выпивать, но как бы пообщаться и так далее. Это будет как бы приветствоваться. Work-life balance – это просто, мне кажется, как святая корова в Австралии. Люди здесь это любят, они хотят, чтобы они утром могли посерфить и потом пойти на работу. Естественно, будут компании, которым все равно на ваш work-life balance. Там большая пятерка консалтингов будут также работать в очень интенсивном режиме.\n",
            "Допустим, тот же самый Эрнст Янг, он позволяет планировать свой день по вашему усмотрению. То есть, вот эти все вещи, они как бы достаточно важны. А где вот все это, извини, что перевела на английский, можно обычно посмотреть? Это все так же, как делается, например, на Glassdoor или есть какие-то другие сайты, где люди делятся? Надо посмотреть на Glassdoor, что там пишут вообще про это все. Ну и спросить на списи тоже. То есть, не задавать вопросы, как у вас в Work-Life Balance, а просто спросить наводящие вопросы и про удаленную работу, и про core hours. Тогда вы поняли, если они скажут, в смысле core hours, с девяти до шести. Ну, понятно, что тогда никаких вариантов нет. Ну, как бы по поводу чего делать не нужно, я уже говорила о том, что там не надо, естественно, какие-то, ну, всегда вот эти boundaries, личные границы. Осторожно, очень аккуратно нужно быть с комплиментами. У меня недавно друг коллеге сделал комплимент, потому что она была классно одета. Он сделал просто ее лук, там сказал, блин, классно подобранная одежда. Она говорит, ну, как бы я тебя предупреждаю, потому что, понятно, да? И он такой немножко запереживал. То есть вот эти вещи, с ними нужно осторожно, нужно видеть, какие люди где, которые придерживаются именно профессиональной этики, да, и, естественно, следить за языком именно в плане вот такой вот директивности. То есть не давать каких-то жестких ответов, аккуратно подбирать там слова и так далее, по крайней мере, пока вы не узнали людей вокруг вас, да. Ну и как своим стать, это, наверное, вот про что я говорила, там участвовать в дрынках, просить помощи обязательно, да, и стараться даже в ситуации, когда понимаешь, если вы туда станете работать, у вас есть свои какие-то принципы, которые вы в России применяли, всегда лучше уточнить, будет ли это здесь нормально. Поэтому нужно спросить руководителя, я хочу сделать вот так, вот так, вот так, это окей или не окей? Он вам подскажет. Нет, сначала со Стивом поговори, а потом уже это делай. То есть вам вот эти вот вещи будут подсказывать. Зарплата самая интересная, понимаешь? Да, я все ждала этого момента. Оставляю слайд по зарплатам разработчиков. Вот это примерно. Понятно, что зарплаты в Австралии от 23 до 405 тысяч средние, это по всем профессиям, да, вот, и средняя зарплата там 89 тысяч, это больше, наверное, Сиднейские такие цены. Разработчиков тоже здесь оставляю, но вот по дата-сантистам, я бы сказала, что дата-сантисты, они такая элитарная профессия, да, в некотором смысле, не так уж их много, то есть людей ищут там и, в общем-то, стараются как бы удерживать и так далее, поэтому доход достаточно большой. Если мы говорим про дата-аналитик, 112 тысяч – это средняя зарплата, вот эти две первые строчки, да, и дата-сантист 165 – это тоже средняя. И вот это вот, смотрите, 750 в день и 1075 в день – это контракт до вычета налогов. То есть вы будете 1000 долларов до вычета налогов в день получать. После вычета, значит, это будет где-то 700. Ну, то есть… Это все же австралийские доллары, правильно? Извини за глупый вопрос. Да, всегда. Всегда, здесь никогда другие валюты не будут обсуждаться. Вот, ну и, соответственно, немножко прикидка по junior, mid, senior, да, то есть вот эта информация, она вся останется. Понятно, что экзекитив от 200 до 500 – это вот реально уже дальше, вот честно, зависит от компании, зависит от многих вещей. Дата-сантист чуть-чуть дороже аналитика. Я хочу здесь сказать, что дата-сантист – это уже считается такая, как это, hard engineering, да, то есть такое, там, где надо много знать. Если ты работаешь дата-аналистом, у тебя нету как бы дата образования, есть какой-то там компьютер, не знаю, information technology или что-то, это окей, да, но если ты дата-сантист, очень много будут смотреть на то, есть ли у тебя профильное образование, потому что это все равно, что работать каким-то другим ученым и, в общем-то, не разбираться, то есть идти в биохимию, но никогда не учиться там на биохимическом факультете. Быстро про налоги, прогрессивная ставка. В среднем вы будете платить где-то 35-45 тысяч, именно потому что 35-45%, прошу прощения, именно потому что мы говорим про достаточно высокие заработные платы, да, то есть все зарплаты выше 100 уже такие, ну, считаются достаточно хорошими. Первые 18 тысяч не покрываются налогом. Вот, в компа есть такое понятие возврата налогов, то есть если вы платите, платите налоги по определенным правилам, ваша ситуация в течение года может меняться, вы подаете в конце финансового года на возврат налога, и вам могут вернуть 2-3 тысячи долларов налога, если вы его переплатили. Оно могут заставить и доплатить, если вы вдруг его не доплатили. Даю стоимость жизни, не буду на этом останавливаться, потому что это прямо надо просто посидеть и вникнуть, это примерные цифры, я даю посиднею, вот, и 30 тысяч на счету, что-то я уже сейчас, наверное, как-то даже сомневаюсь, потому что очень сильно поднялись цены вот за последние полгода, и, ну, да, если сразу на работу выйти, то нормально. Оставляю вот это здесь, да, потом как бы пошерим презентацию, можно будет подробнее посмотреть. Где искать жилье, оставляю тоже эту информацию, скорее для того, чтобы можно было к этому обратиться, и на что обращать внимание. Такие моменты, они, ну, для каждого свои, да. И, да, мои контакты, пожалуйста, обращайтесь, если кто-то будет иметь какие-то вопросы, консультации тоже я провожу, пожалуйста, все. Давай на вопросы, наверное, да? Да, давай на вопросы. Просто хотела еще сакцентировать внимание, да, обращайтесь к Нине, LinkedIn, email. Мы можем выложить на нашем канале и к записи YouTube? Супер, замечательно, выложим тогда тоже. И заодно ссылочки, которые сегодня были в презентации, ну, и презентацию, соответственно, тоже. Мы что-то вот поговорили про резюме, часто вот стоит вопрос, писать ли сопроводительное письмо, вообще играет ли оно какую-то роль, читают ли его работодатели? Много дискуссий на эту тему я наблюдала. То есть очень многие рекрутеры считают, что это отживший жанр. Я бы рекомендовала делать таким образом. Если вам очень нравится компания, очень нравится позиция, напишите сопроводительное письмо, и оно должно быть очень простым. То есть большие сопроводительные письма никто читать не будет и должно читать легко. Структура такая. Приветствия, почему я интересен буду компании, почему компания интересна мне, призыв к действию. Все. И это все можно использовать как летпоинты. Используйте эти чувства юмора, пытайтесь записать как-то достаточно не совсем формально. Австралия – это та страна, которая будет очень сильно уважать формальный язык, только если вы пишете в администрацию президента условно или какие-то государственные компании, где есть какие-то свои там заморочки. Во всех остальных случаях, я помню, я написала как-то формальное письмо, мне сказали, слушай, ты расслабься, потому что у нас в Австралии так не принято. Поэтому используйте чат GPT, пишите правильный промпт, загружайте тогда, я подаюсь на вакансию, прикрепляйте ссылку, вот мое резюме, помоги мне написать сопроводительное письмо, придерживаясь структуры, о которой я сказала. Приветствия, почему мне интересна компания, почему я буду интересен компании, используй bullet points. И вот вам чат GPT напишет это все дело, вы, естественно, это все прочитаете и перепишите так, чтобы это как бы использовать, что-то убрать, что-то добавить и так далее, чтобы это выглядело персонально, да. Ну, то есть, если нравится вакансия, прям очень сильно пишите, писать скорее не более неформальным языком, формальным больше для какого-то госсектора, но в общем и целом большой роли, наверное, сопроводительное письмо не играет. Я бы не прямо вот так сказала, есть компании, которые при подаче на позицию будут делать это как бы обязательным, да, когда нужно написать. Ну и здесь на самом деле зависит, вот мне кажется, вот от важности какого-то конкретного рекрутера, если он прям считает, что я такой важный, у меня такой важный процесс, напиши. Я не люблю читать сопроводительные письма, потому что они очень формальные, они обычно сути не несут. Гораздо больше сути можно вложить в executive summary в начале, которые я пришлю, там будет понятно, как это сделать. Да, конечно. Слушай, у меня, наверное, вопросы почти иссякли. А, нет, есть, наверное, еще один вопрос. Вот интересно, вообще в Европе, в США очень часто российские соискатели сталкиваются с тем, что большая часть собеседований, она посвящена какому-то cultural interview или общению с командой, чем техническим. В Австралии такая же ситуация? Будет очень важно, чтобы был вот этот connect, чтобы кликнуло, чтобы людям было с вами приятно общаться. Именно поэтому важно держаться открыто, не очень серьезно, если чувствуешь, что просто от волнения уже замкнуло. Нужно сказать, очень волнуюсь, честно, мое первое собеседование в Австралии. Это так классно, хотелось бы, ну, там, помогите, да, ну, то есть вот так вот хотят бы сделать. Будут задавать вопросы, а что ты делал в такой-то ситуации? Расскажи ситуацию, в которой ты то-то. А что, а что вот, то есть как бы меньше вероятность, что будут задавать гипотетические вопросы, а будут именно задавать вопросы вот такие. Спросят, очень любят задавать вопросы, а как ты поступал, когда у тебя было несколько проектов, да, то есть они хотят там слышать про приоритизацию, такие вот вещи. Здесь должно быть то, как, в принципе, вы общаетесь, как вы можете объяснить, как вы структурируете информацию, как вы можете про сложные вещи рассказывать простым языком. Ну, и чтобы какой-то матч тоже произошел между тобой, руководителем, например, или командой, я так поняла. Так, ну, у меня вопросы точно не всякли. Наш чат пока что пустой, видимо, мы покрыли все. Алин, ты покрыла все в своей прекрасной презентации. Тогда спасибо тебе огромное вообще за то, что ты к нам сегодня присоединилась, было очень круто и очень полезно. Конечно, хочется еще пообщаться подробнее про компанию и более глубинно. Дорогие слушатели, спасибо, что пришли к нам послушать нас в субботу в 10.30 утра. Это небольшой подвиг. Спасибо вам за то, что слушаете нас в записи. Спасибо еще раз огромное. Спасибо, что пригласили, было очень приятным. Всем удачи, остаемся на связи. Все, всем пока, хороших выходных.\n"
        ]
    },
    {
        "url": [
            "https://www.youtube.com/watch?v=h_oNVxy0IOQ"
        ],
        "title": [
            "Как решать задачи | Симулятор SQL | karpov.courses"
        ],
        "description": [
            "Урок: https://lab.karpov.courses/learning/152/module/1762/lesson/18484/53200/251004/\nСимулятор SQL: https://bit.ly/3rkSaY0"
        ],
        "audio_path": [
            "../data/audio/h_oNVxy0IOQ.mp4"
        ],
        "text": [
            "Итак, я надеюсь, вы посмотрели, что за данные хранятся в наших таблицах. Перед тем, как мы двинемся дальше, давайте на секундочку остановимся и поговорим про практический аспект нашего курса. Как я уже сказал, у нас будет довольно много практики, и она будет в понятном всем формате. Вам нужно при помощи скользопросов решать различные продуктовые задачки. То есть, по сути, от вас будет требовать написать искольдзапрос, который вернет нужные для задачи данные. Давайте первую задачу решим вместе, и я покажу вам, как устроена проверка задач в нашей платформе. Вот вы видите первую задачу, которая будет у нас в нашем курсе. Это написать искольдзапрос, который вернет все колонки и 100 строк из таблички действий курьеров, отсортированных по убыванию значения один курьер. Мы этот запрос уже тренировали в предыдущем занятии, поэтому давайте просто его вспомним. Перед тем, как решать задачки, я бы советовал вам взять вот это условие. Вы можете даже скопировать его в передаж, поставить знак «комментария». Знак «комментария» — это 2 тире, то есть эта команда не будет исполняться. Это просто будет текст, который вы можете использовать. И дальше сначала написать этот запрос именно в редаже, то есть потренироваться, убедиться в том, что запрос работает. То есть представляйте задачку, как будто я вам, как ментор, ваш Team Lead написал на работе, посчитай, пожалуйста, пришли мне запрос, который вернет вот такой-то результат. И перед тем, как его мне отправить условно на проверку, ваша задача действительно убедится в том, что он корректно работает. И лучше это сделать в редаже на настоящих данных, чтобы посмотреть, что действительно запрос возвращает то, что нужно. То есть еще раз, давайте напишем тогда нужный нам запрос. Что у нас? Напишите запрос, который вернет все колонки из таблицы вот из этой таблички. Ну давайте сейчас для простоты дела напишем звездочка, from табличка. Дальше что мы видим? Отсортированных по убыванию ID курьера. То есть order by ID курьера по убыванию и всего 100 строк. Запустим этот запрос и убедимся, что он работает. То есть вот он возвращает 100 строчек. Теперь давайте мы протестили, поняли, что наш запрос работает, и мы можем его скопировать, вернуться на платформу, ставить этот запрос и отправить его на проверку. Соответственно, мы получим фидбэк, что наша задача сдана. Теперь еще пару моментов по задаче. Первое. Обратите внимание, что условия задачи не всегда будут сформулированы на языке SQL. И это тоже очень важно понимать. Когда к вам придут заказчики, ваш team lead или менеджер из другой команды или другие аналитики, они очень часто задачу перед заданием могут ставить не на языке формально. Напиши нам запрос, который вернет все колонки, отсортированные по ID при помощи order by и используя limit 100. Они могут написать вам условно задачу. Пришли, пожалуйста, запрос, который вернет топ-5 курьеров из таблицы по их IDшникам. То есть это будет язык продуктовой аналитики, и вы должны его перевести на язык запросов. То есть, допустим, вот здесь у нас просто, видите, сказано все колонки и 100 строк. То есть в самой задаче нигде не сказано слова limit. Вам со временем нужно будет самим научиться понимать, как бы какие аспекты языка SQL используются для того, чтобы возвращать сортированные данные, группированные данные, посчитанные данные и так далее. Это вот такое важное, так сказать, отклонение, про это не будем забывать. Второй важный аспект, как я уже сказал, вам всегда лучше протестировать решение ваше, перед тем как отправлять на проверку, но даже не всегда решение, которое правильно работает, будет приниматься. Поясню почему. Допустим, мы можем ошибиться и случайно сделать запрос, который вернет 100 записей, только из другой таблицы, из UserActions. И в этом смысле этот запрос будет работать правильно, то есть он как бы возвращает действительно 100 строчек, вот, просто из другой таблицы. И в таком случае в нашей системе проверки вы получите, как вы видите, здесь ошибку и вот некоторые подсказочки, в какую сторону можно двигаться для того, чтобы понять, что не так. В данном случае, вот видите, у нас проверки именно выбранных столбцов, то есть очевидно, что столбцы, которые есть в табличке UserActions, они просто не подходят под то, что мы хотим увидеть из таблички другой, в задании. Поэтому мы можем, получается, отправить запрос, который работает, но неправильный. И еще один вариант. Мы можем отправить запрос, который, вот допустим, будет близок к верному ответу, но он не будет работать. Обратите внимание, что я пытаюсь сейчас вытащить 100 строчек из таблицки курьеров, но сортировку я делаю по UserID, а UserID вообще нету в этой таблице, вот такой колонке. И поэтому, опять же, такое решение в данном задании тоже не пройдет, и в этом случае вы просто получите сообщение о том, какую ошибку вернул Postgres, когда не смог выполнить ваш запрос. Таким образом, важно понимать несколько вещей про практику в нашем курсе. Первое. Чем дальше мы будем уходить, тем меньше подсказок будет в самом тексте задачи. То есть сейчас первая задача действительно сформулирована, по сути, она описывает запрос. Чем дальше мы будем двигаться дальше, тем больше будет сформулирована некоторая продуктовая проблема. Найдите курьера, который не смог доставить заказ к тому-то с таким-то условием там-то. И в этом нет ничего про SQL, это просто чисто продуктовая проблема. Вам нужно будет самому научиться, самим научиться переводить это с языка, человеческого языка на язык SQL. Второе. Обязательно тестируйте ваши ответы перед тем, как отправлять их на проверку, потому что тестировать и понимать, где ошибка, гораздо проще в Redash, чем просто в задании для проверки. Но при этом вы можете и здесь тоже, вы поняли, что посмотрели на ошибку и такие «а, у нас же там другая таблица», поэтому можно в принципе и здесь тоже просто быстренько переписать наш запрос для того, чтобы он стал рабочим. Ну и мы постарались максимально сделать так, чтобы различные форматы ответа тоже принимались. То есть в том смысле, что, например, вот эту задачку мы могли бы решить просто используя select звездочка, либо мы могли бы написать select и перечислить здесь все нужные нам поля. То есть написать, допустим, action, запятая и курьера, order id, time. И, как вы понимаете, это две абсолютно одинаковые записи, то есть одну и ту же задачу можно решить по сути как бы разными способами, и оба таких варианта будут в системе приняты. Более того, если мы возьмем какой-нибудь другой порядок колонок, то тоже это не должно стать проблемой для чекера. Вот это то, как устроена у нас практика. По сути, больше 99% всей практики – это необходимость написать какой-то SQL-запрос для решения той или иной задачи. И перед тем, как его написать, протестируйте его в Redasha, после этого отправляйте на проверку, смотрите, что за текст ошибки вы получили, если ответ неправильный, а если все правильно, то можете двигаться дальше.\n"
        ]
    }
]